import React from 'react';

const WarmHintOfRegisterToPABank = () => {
    return (
        <div style={{padding:"0.9375rem",color:"#999",fontSize:"0.875rem"}}>
            <div className="header">温馨提示：</div>
            <p style={{margin:"0.3125rem 0",fontSize:"0.75rem"}}>1、平安银行不对网络借贷交易行为提供保证或担保，不承担借贷违约责任，不对网络借贷资金本金及收益予以保证或承诺，不承担资金运用风险，不承担借款项目及借贷交易信息真实性的审核责任，不对网络借贷信息数据的真实性、准确性和完整性负责。</p>
            <p style={{margin:"0.3125rem 0",fontSize:"0.75rem"}}>2、开通授权投标、授权债权转让、授权还款、授权提现中的某一项或某几项自动授权功能即代表您授权饭米粒理财（以下简称“平台”）代您进行相应的自动业务操作，具体授权范围以您与平台签署的授权协议为准。开通授权代表您知晓并同意存管系统有权根据平台发起的自动扣划指令，进行相应款项的划扣、支付、冻结及行使其他权利，该指令将视为您的真实意思表示，相关风险由您自行承担，您对此予以接受和认可。授权后，平台将有权根据与您约定的授权范围（授权投标、授权债权转让、授权还款、授权提现）操作您的账户资金进行相关自动业务操作，需要您自行承担相应的资金风险和责任，请您谨慎操作。</p>
        </div>
    );
};

export default WarmHintOfRegisterToPABank;