require("../../scss/page/serviceAgreement.scss");
import React from "react";

function RegisterServiceAgreement() {
  return (
    <div className="protocol" style={{ padding: "1rem", overflowY: "scroll" }}>
      <div className="con">
        <h4>重要提示：</h4>
        <p>
          (1)深圳农泰金融服务有限公司（以下简称“农泰金融”）运营管理包括“饭米粒理财”、“农泰金融”等品牌在内的互联网PC端、微信公众号以及手机APP客户端（以下简称“农泰金融平台”），农泰金融依据本协议约定为农泰金融平台注册用户（以下称“您”）提供服务，本协议在您与农泰金融间具有合同上的法律效力。您一经在农泰金融平台注册并勾选“我已阅读并同意《用户注册协议》”，即表示您接受本协议全部条款并受本协议约束，同意使用农泰金融依据本协议为您提供的服务。如您不接受本协议的全部或部分条款，请避免在农泰金融平台注册或使用农泰金融提供的任何服务。
        </p>
        <p>
          (2)农泰金融特别提示您仔细阅读并充分理解本协议全部条款，尤其是涉及免除或限制农泰金融责任、涉及您的权利义务及责任等对您的权益有或可能有重大影响的条款。
        </p>
        <p>
          (3)如您需要使用农泰金融依据本协议为您提供的服务，您应直接登录农泰金融平台；如您需要与农泰金融取得联系，您应拨打农泰金融客服电话400-6322-688，避免拨打其他任何电话；如农泰金融平台网址或客服电话发生变更，将以公告形式予以公布。
        </p>

        <h4>一、声明与承诺 </h4>
        <h5>1.1您确认并承诺：</h5>
        <p>(1)您签署本协议时，您是具有完全民事权利能力和完全民事行为能力、能够独立承担民事责任的自然人、法人或其他组织。如您不具备上述条件，请您立即终止签署本协议。</p>
        <p>(2)您确保按农泰金融要求向农泰金融提供您真实、有效、完整及最新的信息和资料；如您的信息和资料发生变更，您确保及时予以更新。</p>
        <p>(3)如您提供的信息或资料存在或可能存在虚假、无效、不完整或过期情形，农泰金融有权中止或终止依据本协议为您提供的服务，由此产生的任何支出和损失以及法律后果和法律责任由您承担，农泰金融不因此承担任何法律责任。</p>
        <p>(4)如您提供的信息或资料存在或可能存在虚假、无效、不完整或过期情形，导致农泰金融无法依据本协议为您提供服务或为您提供的服务发生错误，您不得以此作为取消交易或拒绝付款的理由，由此产生的法律后果由您承担，农泰金融不因此承担任何法律责任。</p>
        <p>(5)您通过农泰金融平台进行交易的资金来源合法。</p>
        <h5>1.2您完全了解并同意：</h5>
        <p>(1)在本协议履行过程中，农泰金融有权根据法律法规和业务需要单方变更本协议条款；一旦本协议条款发生变更，农泰金融将通过农泰金融平台公布变更后的本协议，不再另行单独通知您。如您不接受变更后的本协议全部条款，请您立即停止使用农泰金融为您提供的服务；如您继续使用农泰金融依据变更后的本协议为您提供的服务，即表示您已仔细阅读、充分理解并同意接受变更后的本协议全部条款。</p>
        <p>(2)农泰金融通过农泰金融平台公告、电子邮件、手机短信等电子方式或信件、快递等非电子方式向您发送关于农泰金融服务的通知，该通知发送当日即视为已送达您。因信息传输等原因导致您未能在通知发送当日收到该通知，农泰金融不因此承担任何法律责任。</p>
        <p>(3)农泰金融有权依据独立判断临时调整向您提供的服务，包括但不限于暂停、限制或改变向您提供的服务，如您继续使用农泰金融提供的服务，即表示您已同意农泰金融对服务的临时调整。</p>
        <p>(4)无需获得您同意农泰金融即可向农泰金融关联实体转让与农泰金融平台有关的全部或部分权利或义务；未经农泰金融书面同意，您不得转让您在本协议项下的任何权利或义务。</p>

        <h4>二、农泰金融服务内容 </h4>
        <h5>2.1农泰金融服务：指农泰金融通过农泰金融平台向您提供的服务，服务内容包括但不限于交易信息服务、交易管理服务、交易辅助服务和合同管理服务，具体服务内容以农泰金融当时实际提供的服务为准。</h5>
        <h5>2.2交易信息服务 </h5>
        <p>农泰金融为您提供如下交易信息服务：</p>
        <p>(1)交易信息发布服务：您应确保您在农泰金融发布的交易信息真实、合法、有效并承担因此产生的法律后果和法律责任由您承担，农泰金融不因此承担任何法律责任。</p>
        <p>(2)交易信息传递服务：农泰金融向您传递的交易信息仅供您参考，农泰金融未以任何形式对传递的交易信息的真实性、合法性、有效性提供保证或担保，您应对农泰金融传递的交易信息进行独立判断并做出交易决策；您依据农泰金融传递的交易信息进行交易产生的法律后果和法律责任由您承担，农泰金融不因此承担任何法律责任。</p>
        <h5>2.3交易管理服务  </h5>
        <p>您完全了解并同意农泰金融按照如下方式为您提供交易管理服务： </p>
        <p>(1)您在农泰金融平台注册时将生成您的农泰金融注册用户账户（以下简称“农泰金融账户”），该账户作为您登录农泰金融平台的唯一账户将记载您在农泰金融平台的活动。</p>
        <p>(2)您通过农泰金融平台按农泰金融服务流程所确认的交易或操作将成为农泰金融为您进行相关交易或操作（包括但不限于订立合同、支付或收取款项、冻结资金）的不可撤销的指令；相关指令执行时间以农泰金融实际交易或操作时间为准；您因未及时提交、确认、修改交易或操作产生的损失由您承担，农泰金融不因此承担任何法律责任。</p>
        <p>(3)农泰金融服务需要您根据农泰金融要求完成身份认证及银行卡认证，您因未完成认证而无法享受农泰金融服务产生的损失由您承担，农泰金融不因此承担任何法律责任。</p>
        <p>(4)农泰金融未以任何形式保证您通过农泰金融平台发出借款要约或投资意向后，能够实际借款或投资成功；您在农泰金融平台进行借款或投资等交易的法律后果和法律责任以及由此产生的损失（包括但不限于利息、手续费）由您承担，农泰金融不因此承担任何法律责任。</p>
        <p>(5)您通过农泰金融平台进行交易或收取款项时，您因未遵守本协议条款或农泰金融公布的各项规则而产生的损失由您承担，农泰金融不因此承担任何法律责任。如发生上述情况导致相关款项已错误的划转至您的农泰金融账户，您同意农泰金融有权直接从您的农泰金融账户扣回该笔款项或取消您要求支付该笔款项的操作；如该笔款项已划转至您的银行账户，农泰金融有权向您索回，因此产生的费用由您承担。</p>
        <p>(6)农泰金融有权纠正因系统故障或其他任何原因导致的处理错误；如该错误导致您款项实收金额大于应收金额，您应根据农泰金融向您发出的有关纠正错误通知的具体要求返还多收的款项或进行其他操作；农泰金融也有权直接或委托第三方从您的个人账户扣回您多收的款项或以其他任何方式向您索回；您因处理错误而多付或少付的款项均不计利息，由此产生的损失由您承担，农泰金融不因此承担任何法律责任。</p>
        <p>(7)农泰金融有权基于交易安全等方面考量不时对涉及交易的相关事项进行设定，包括但不限于交易限额、交易次数等。</p>
        <h5>2.4交易辅助服务  </h5>
        <p>2.4.1农泰金融为您提供如下交易辅助服务：</p>
        <p>(1)银行卡认证：为使用农泰金融或农泰金融委托的第三方提供的充值、提现、代扣等服务，您应按农泰金融服务流程提交以您本人名义登记的有效银行借记卡等信息，农泰金融审核通过后会将您的农泰金融账户与您登记的有效银行借记卡进行绑定。</p>
        <p>(2)充值：您可以通过农泰金融指定的方式向您的农泰金融账户充入资金用于在农泰金融平台进行交易，农泰金融不支持使用银行信用卡充值。</p>
        <p>(3)代收/代付：农泰金融或农泰金融委托的第三方代为收取农泰金融其他注册用户、农泰金融合作担保机构等向您的农泰金融账户支付的本金、利息、违约金、代偿金等各类款项，或者将您农泰金融账户的资金支付至您指定的其账户。</p>
        <p>(4)提现：您可以通过农泰金融指定的方式将您农泰金融账户的资金转出至您登记的有效银行借记卡。</p>
        <p>(5)查询：农泰金融将记录您在农泰金融平台的全部交易或操作，您可以通过您的农泰金融账户查询您的交易或操作记录。</p>
        <p>2.4.2您完全了解并同意：</p>
        <p>(1)您承诺您合法拥有进行充值的银行借记卡的所有权及卡内资金的支配权，并确认将进行充值的银行借记卡作为可选的资金提现渠道。</p>
        <p>(2)您不得利用充值功能进行信用卡套现、匿名转账、虚假交易、洗钱等行为，否则，您所充值的资金将退回原卡，且农泰金融有权暂停、关闭或删除您的农泰金融账户，由此产生的损失和后果由您自行承担，农泰金融不因此承担任何法律责任。</p>
        <p>(3)您提现或退款时因您的提现银行卡状态异常（包括但不限于挂失、销户）造成的到账延迟或退回，由您自行承担和解决。</p>
        <p>(4)因充值、代收/代付、提现服务涉及农泰金融与第三方的合作，受限于第三方可能仅在工作日进行资金代扣或划转等因素，农泰金融不对资金到账时间提供保证或担保，也不因此承担任何法律责任。</p>
        <p>(5)您通过农泰金融平台查询的任何信息仅作为参考，不作为交易或操作的证据或依据；如查询信息与农泰金融记录不一致的，以农泰金融记录为准。</p>
        <p>(6)您一经使用交易辅助服务，即表示您不可撤销地授权农泰金融进行相关操作，该操作不可逆转，您不能以任何理由取消交易或拒绝付款。</p>
        <p>(7)农泰金融依据本协议为您提供服务的过程中有权以各种方式投放商业广告或其他商业信息，您同意接收农泰金融通过电子邮件、短信或其他方式向您的发送商业广告或其他商业信息。</p>
        <p>2.4.3第三方：除非另有约定，本协议所指第三方包括但不限于金融机构（包括但不限于银行、基金公司、证券公司、保险公司）、第三方支付机构、担保机构。</p>
        <h5>2.5合同管理服务 </h5>
        <p>您完全了解并同意农泰金融按照如下方式为您提供合同管理服务：</p>
        <p>(1)您通过农泰金融平台进行的交易采用电子合同或书面合同方式订立合同，您使用您的农泰金融账户在农泰金融平台通过点击确认或类似方式签署的电子合同具有法律效力；您应妥善保管您的农泰金融账户及密码等信息，不得以账户及密码等信息被盗用或其他理由否认已订立合同的效力或不按已订立的合同履行义务。</p>
        <p>(2)您完全了解并授权农泰金融将您的信息和资料提交至第三方电子认证服务机构（如有）代为申请专属于您的数字证书，您同意使用该数字证书通过农泰金融平台在线签署及确认电子合同等法律文件。</p>
        <p>(3)农泰金融向您提供电子合同的备案、查询、核对服务，电子合同文本以农泰金融记录为准。</p>
        <h4>三、服务费用 </h4>
        <p>3.1您需要就使用农泰金融依据本协议为您提供的服务向农泰金融支付服务费用，各项服务费用以农泰金融平台公布为准，农泰金融有权单方制定或调整各项服务费用。</p>
        <p>3.2您可能需要就使用农泰金融依据本协议为您提供的服务向第三方支付相关费用，各项费用以该第三方或农泰金融平台公布为准，您与该第三方就相关费用产生的争议或纠纷与农泰金融无关。</p>

        <h4>四、账户安全及管理 </h4>
        <h5>4.1您完全了解并同意：</h5>
        <p>(1)您应根据农泰金融相关规则或提示创建您的农泰金融账户密码（您应避免使用过于简单的字符作为您的密码，例如您的姓名、生日等），且有义务确保您的农泰金融账户及密码等信息安全。</p>
        <p>(2)您不得向他人泄露您的农泰金融账户或密码，也不得使用他人的农泰金融账户或密码；非农泰金融原因导致您的农泰金融账户被他人非法使用的，农泰金融不因此承担任何法律责任。</p>
        <p>(3)农泰金融通过您的农泰金融账户及密码识别您的指令，因此使用您的农泰金融账户及密码登录农泰金融平台后进行的一切操作均代表您本人亲自所为，您的农泰金融账户操作所记载的电子信息记录作为您行为的有效凭据，由此产生的法律后果和法律责任由您承担，农泰金融不因此承担任何法律责任。</p>
        <h5>4.2您完全了解并同意，农泰金融有权依据独立判断在认为可能发生危害交易安全等情形时，无需通知即可中止或终止向您提供本协议约定的全部或部分服务，也可暂停、关闭或删除您的农泰金融账户并移除或删除您农泰金融账户中全部资料或档案，农泰金融不因此承担任何法律责任（上述中止、终止、暂停、关闭、删除不代表您责任的免除，您仍应对使用农泰金融依据本协议提供的服务期间的行为承担法律责任，且农泰金融仍可保留您的相关信息）。该等情形包括但不限于：</h5>
        <p>(1)农泰金融认为交易异常或对交易有其他异议；</p>
        <p>(2)农泰金融认为您的农泰金融账户涉嫌洗钱、套现、被冒用、被盗用及其他农泰金融认为存在风险的情形；</p>
        <p>(3)农泰金融认为您已违反本协议约定或农泰金融公布的与本协议有关的各项规则；</p>
        <p>(4)您使用农泰金融提供的收费服务但未如约支付相关服务费用；</p>
        <p>(5)您的农泰金融账户已连续三年未使用且账户余额为零。</p>

        <h5>4.3如您发现他人冒用或盗用您的农泰金融账户或密码以及其他任何未经您合法授权的情形，您应立即以有效方式通知农泰金融，申请农泰金融暂停相关服务，否则由此产生的损失或责任由您自行承担；因农泰金融对您的申请采取行动需要合理时间，在此之前，农泰金融对他人冒用或盗用您的农泰金融账户或密码所产生的损失不承担任何法律责任。</h5>
        <h5>4.4如您决定不再使用农泰金融账户，您首先应清偿全部应付款项（包括但不限于借款本金、利息、罚息、担保费），再将您农泰金融账户中的可用款项（如有）全部提现或者向农泰金融发出其他合法有效支付指令，并向农泰金融申请注销您的农泰金融账户，经农泰金融审核同意后您的农泰金融账户将正式注销。</h5>
        <h5>4.5如农泰金融注册用户死亡或被宣告死亡，其在本协议项下的各项权利义务由其继承人继承；如农泰金融注册用户丧失全部或部分民事权利能力或民事行为能力，农泰金融或农泰金融委托的主体有权依据有效法律文书（包括但不限于生效法院判决）或农泰金融注册用户法定监护人的指示处置与其农泰金融账户相关的交易和资金。</h5>
        <h5>4.6您可使用您在农泰金融合作机构注册的账号登录农泰金融账户而无需另行注册，但您应确保您对农泰金融账户对应的农泰金融合作机构注册账号拥有合法使用权。如您丧失您在农泰金融合作机构注册账号的使用权，农泰金融有权停止为您提供服务；如您的农泰金融账户存有资金余额，您可向农泰金融申请变更您的农泰金融账户或将资金余额转移至以您本人名义登记的银行账户。</h5>

        <h5>5、责任范围及限制 </h5>
        <p>5.1农泰金融依据本协议为您提供服务过程中涉及由第三方提供相关服务的法律责任由该第三方承担，农泰金融不因此承担任何法律责任。农泰金融不承担法律责任的情形包括但不限于：</p>
        <p>(1)因第三方未按照您或农泰金融的指令予以执行产生的损失或责任；</p>
        <p>(2)因第三方原因导致资金未到账或未及时到账产生的损失或责任；</p>
        <p>(3)因第三方对交易限额或交易次数等进行限制产生的损失或责任；</p>
        <p>(4)其他因第三方原因或行为产生的损失或责任。 </p>
        <p>5.2农泰金融依据本协议为您提供服务过程中涉及您自身原因产生的损失和责任由您自行承担，农泰金融不因此承担任何法律责任。农泰金融不承担法律责任的情形包括但不限于： </p>
        <p>(1)因您未按照本协议或农泰金融平台公布的与本协议有关的各项规则进行操作产生的损失或责任；</p>
        <p>(2)因您使用的银行卡原因产生的损失或责任，包括但不限于您使用信用卡或未经认证的银行借记卡、非您本人的银行借记卡以及您使用的银行借记卡被冻结、挂失产生的损失或责任；</p>
        <p>(3)因您向农泰金融发送的指令信息不明确、不完整或存在歧义等产生的损失或责任；</p>
        <p>(4)因您的农泰金融账户余额不足产生的损失或责任</p>
        <p>(5)因您自身原因导致您的农泰金融账户密码被遗忘、被泄露、被破解或您使用的计算机系统被第三方侵入或其他不当操作产生的损失或责任。</p>
        <p>5.3您完全了解并同意，基于互联网的特殊性，农泰金融不保证服务不被中断，也不承诺服务的及时性和安全性；农泰金融系统因相关状况无法正常运作导致您无法使用农泰金融提供的服务或使用农泰金融提供的服务时受到任何影响时，农泰金融不因此承担任何法律责任。上述状况包括但不限于：</p>
        <p>(1)农泰金融系统停机维护；</p>
        <p>(2)电信设备发生故障不能进行数据传输；</p>
        <p>(3)因黑客攻击、网络供应商技术调整或故障、网站升级、第三方等原因导致农泰金融提供的服务中断或延迟；</p>
        <p>(4)因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力因素导致农泰金融系统无法正常运作。</p>
        <p>5.4您完全了解并同意，农泰金融未以任何形式对农泰金融提供的服务给予保证或担保，包括但不限于：</p>
        <p>(1)农泰金融服务将符合您的需求；</p>
        <p>(2)农泰金融服务将及时提供、不受干扰或免于出错；</p>
        <p>(3)您经由农泰金融提供的服务购买或取得的任何产品、服务、资讯或其他资料符合您的预期。</p>
        <p>5.5您完全了解并同意： </p>
        <p>(1)由农泰金融合作机构提供服务的服务内容和服务质量由该合作机构负责；</p>
        <p>(2)农泰金融平台的内容可能涉及由其他方所有、控制或运营的网站，农泰金融不保证其他方网站信息的真实有效；</p>
        <p>(3)您确认将按照其他方网站相关协议而非本协议使用其他方网站，您应对其他方网站的内容、产品、广告等信息进行独立判断并承担风险，农泰金融不因此承担任何法律责任；</p>
        <p>(4)对于您使用农泰金融提供的服务下载或取得的资料和信息，您应独立判断并承担风险，因资料下载而导致的任何损坏均由您自行承担；</p>
        <p>(5)农泰金融不保证基于为您提供便利而设置的外部链接的准确、有效、安全和完整，对于该外部链接指向的不由农泰金融实际所有、控制或运营的网页内容，农泰金融不承担任何法律责任；</p>
        <p>(6)您自农泰金融和农泰金融工作人员或经由农泰金融提供的服务取得的书面或口头的建议或资讯，均不构成农泰金融对农泰金融提供服务的保证或担保。</p>
        <p>5.6您完全了解并同意，在法律允许前提下，农泰金融对因如下情形导致的任何损失（包括但不限于业务损失、收益损失、利润损失、使用数据或其他经济利益的损失）不承担任何法律责任：</p>
        <p>(1)与本协议有关或由本协议引起的；</p>
        <p>(2)您因使用农泰金融平台或通过农泰金融提供给您的全部信息、内容、材料、产品和服务引起的。</p>
        <p>5.7除本协议另有约定外，在任何情况下，农泰金融因本协议承担的违约责任赔偿金额不超过向您收取的当次农泰金融相关服务费用总额。</p>

        <h4>六、隐私权保护及授权条款 </h4>
        <p>6.1为更好地为您提供服务，农泰金融可能自公开或非公开渠道、农泰金融合作机构收集您的额外资料，农泰金融将按本协议和行业标准惯例对您提供的或农泰金融自行收集的资料予以使用、披露和保护，并采取相关措施确保资料安全。但因技术限制或第三方非法盗取等原因导致您的资料发生泄露的，农泰金融不因此承担任何法律责任。</p>
        <p>6.2农泰金融按照您在农泰金融平台上的行为自动追踪关于您的某些资料；在不透露您的隐私资料的前提下，农泰金融有权对整个注册用户数据库进行分析及商业上的利用。</p>
        <p>6.3您完全了解并同意</p>
        <p>(1)农泰金融有权使用关于您的相关信息和资料（包括但不限于您提供的资料、从您在农泰金融平台上的行为获取的资料、农泰金融通过公开或非公开渠道收集的资料）；</p>
        <p>(2)如您向农泰金融合作机构提供您的资料，农泰金融有权从该合作机构获取并使用关于您的相关信息和资料；</p>
        <p>(3)农泰金融有权通过人工或自动程序对您的信息和资料进行评价；</p>
        <p>(4)除法律另有规定外，有权将您提供给农泰金融的信息、使用农泰金融产生的信息以及农泰金融根据本条约定查询或收集的信息，用于农泰金融及其因服务必要委托的合作机构为您提供服务、推荐产品、开展市场调查和信息数据分析；</p>
        <p>(5)除法律另有规定外，基于为您提供更优质服务和产品的目的，有权向农泰金融的合作机构提供、查询、收集您的信息。</p>
        <p>(6)在您未能按照与农泰金融或农泰金融其他注册用户签订的相关协议等法律文件的约定履行相应义务时，农泰金融有权依据独立判断或者与该笔交易有关的其他注册用户请求披露您的个人资料；</p>
        <p>(7)在您严重违反农泰金融相关规则的情况下，农泰金融有权将您提供的或农泰金融自行收集的您的个人资料编辑入农泰金融平台黑名单予以披露，并有权与农泰金融合作机构进行数据共享，以便农泰金融平台和农泰金融合作机构催收逾期借款或对您的其他申请进行审核，由此可能造成的损失由您自行承担，农泰金融不因此承担任何法律责任。</p>
        <p>(8)您同意并授权农泰金融向中国人民银行金融信用信息基础数据库以及经国务院或其他政府有权部门批准合法设立的征信机构、中国互联网金融协会报送您的信用信息，报送的信用信息包括但不限于负债信息及偿债履约能力判断信息；</p>
        <p>(9)您授权农泰金融可在您借款业务申请阶段及业务存续期间向中国人民银行金融信用信息基础数据库以及经国务院或其他政府有权部门批准合法设立的征信机构、中国互联网金融协会查询您的信用信息，查询的信用信息包括但不限于负债信息及偿债履约能力判断信息。</p>
        <p>6.4除非发生以下情形，农泰金融不会向第三方恶意出售或免费共享您因履行本协议提供给农泰金融的信息和资料：</p>
        <p>(1)需要相关必要材料以提供独立服务的供应商，如印刷厂、邮递公司等；</p>
        <p>(2)具有合法调阅资料并从合法渠道调阅资料的国家机关或其他有权机构，如公安机关、人民法院等；</p>
        <p>(3)农泰金融关联实体。</p>

        <h4>七、法律适用及争议解决 </h4>
        <p>7.1本协议由您与农泰金融共同订立，适用于您在农泰金融的全部活动。本协议内容包括但不限于本协议正文条款及农泰金融已经发布或将来发布的相关规则，全部条款和规则为本协议不可分割的一部分，与本协议正文具有同等法律效力。</p>
        <p>7.2本协议不涉及您与其他农泰金融注册用户间因网上交易产生的法律关系及法律纠纷。但您同意将全部接受并履行与其他农泰金融注册用户在农泰金融签订的电子法律文本。</p>
        <p>7.3如本协议中任何条款全部或部分无效或不具有执行力，则应认为该条款可与本协议分割，并可被尽可能接近各方意图的、能够保留本协议要求目的的、有效的新条款取代。此等情况下，本协议其他条款仍然有效并具有约束力。</p>
        <p>7.4农泰金融对本协议拥有最终解释权。</p>
        <p>7.5本协议的签订、履行、终止、解释及纠纷解决等均适用中华人民共和国法律。</p>
        <p>7.6本协议签订地为中国广东省深圳市南山区。因本协议产生的争议或纠纷如无法协商解决，您或农泰金融均有权将争议或纠纷提交深圳市南山区人民法院。</p>
      </div>
    </div>
  );
}

module.exports = RegisterServiceAgreement;
