require("../../scss/page/serviceAgreement.scss")
import React from "react";
import Container from "../UIComponents/Container";

function ServiceAgreement_autoPurchase() {
    return (
        <Container scrollable={true} className="protocol">
            <section>
                <h2>1.协议主体及效力</h2>
                <p>饭米粒理财网站自动投标授权书》（以下简称“本协议”）的双方主体为饭米粒理财网站（域名：www.ntjrchina.com）及APP的运营商深圳农泰金融服务有限公司（以下简称的“饭米粒理财”）与饭米粒理财注册会员。</p>
                <p>本协议经饭米粒理财注册会员通过饭米粒理财点击设置自动投标条件、成功开启自动投标功能、确认已阅读并同意本协议后立即生效。</p>
            </section>

            <section>
                <h2>2.自动投标释义</h2>
                <p>自动投标，是指符合条件的饭米粒理财注册会员通过饭米粒理财系统内设置个人自动投标的投资条件并启用该自动投标功能的，即为全权授权饭米粒理财，在新的借款标发布时，根据注册会员设置的投资条件及饭米粒理财规定的自动投标规则，通过运行自动投标系统帮助已启用自动投标功能的注册会员完成投标。</p>
            </section>

            <section>
                <h2>3.申请条件 </h2>
                <p>已经通过饭米粒理财的会员认证并在有效期内的注册会员，均可在饭米粒理财系统设置自动投标条件并开启自动投标功能。</p>
            </section>

            <section>
                <h2>4.自动投标功能 </h2>
                <p>饭米粒理财按已在饭米粒理财公示的《饭米粒理财自动投标规则》中约定的规则与程序为有效开启自动投标功能的会员提供自动投标服务。饭米粒理财会员必须在签署本协议之前认真阅读并充分理解饭米粒理财已公示的《饭米粒理财自动投标规则》。饭米粒理财会员一旦签署本协议即表示并完全接受《饭米粒理财自动投标规则》。《饭米粒理财自动投标规则》为本协议附件。与本协议具有同等法律效力。</p>
            </section>

            <section>
                <h2>5.自动投标功能的启用生效</h2>
                <p> 符合条件的饭米粒理财注册会员按照饭米粒理财规定的设置程序设置自动投标的投资条件后，只要复选“我已阅读并同意签署饭米粒理财自动投标协议”并按照饭米粒理财规定的程序开启自动投标功能的，饭米粒理财注册会员的行为即表示同意并签署了本协议。自动投标功能设置成功后，该注册会员立即享受饭米粒理财提供的自动投标服务。</p>
            </section>

            <section>
                <h2>6.自动投标功能的终止</h2>
                <p>饭米粒理财注册会员成功设置并启用饭米粒理财自动投标功能后，发生以下情形之一的，饭米粒理财将有权终止该注册会员的自动投标功能：</p>
                <div style={{ paddingLeft: "1rem", color: "#999", fontSize: "0.875rem" }}>
                    （1）饭米粒理财注册会员的服务功能终止的；<br />
                    （2）会员应违反饭米粒理财公布的各项规则及所签署的各类协议（包括与饭米粒理财签署的协议、通过饭米粒理财与饭米粒理财其他用户签署的协议）的约定，饭米粒理财认为应当终止该会员的自动投标服务的；<br />
                    （3）其他饭米粒理财认为应当终止注册会员的自动投标功能的情形。
                </div>
            </section>

            <section>
                <h2>7.声明与保证</h2>
                <p>饭米粒理财注册会员声明并保证如下：</p>
                <div style={{ paddingLeft: "1rem", color: "#999", fontSize: "0.875rem" }}>
                    （1）已认真阅读并完全理解本协议全部条款，对本协议条款的含义及相应的法律后果已完全知晓并充分理解，自愿接受本协议的全部内容。<br />
                    （2）已认真阅读通过自动投标所要签署的全部格式合同的全部条款，已对该全部格式合同条款的含义及相应法律后果完全知晓并充分理解。<br />
                    （3）通过饭米粒理财自动投标功能投标成功的，所要签署的全部合同一经自动投标成功即视为注册会员已全部签署，注册会员接受并保证基于自动投标所产生的全部法律后果均由注册会员自行承担并保证完全履行全部合同。
                 </div>
            </section>

            <section>
                <h2>8.规则修改 </h2>
                <p>饭米粒理财有权按照业务实际情况，修改《饭米粒理财自动投标规则》，以准确地反应饭米粒理财的全部权益。《饭米粒理财自动投标规则》的修改及部分修改，饭米粒理财会在更改之日在网站公示时并即时生效。饭米粒理财会员应注意《饭米粒理财自动投标规则》的变更，如不同意规则变更的内容，应立即自己操作取消自动投标功能，否则，本协议继续有效。</p>
            </section>

            <section>
                <h2>9.条款独立性</h2>
                <p>本协议中部分条款因违反法律法规无效或部分无效的，该无效条款不影响本协议项下其他条款的效力。</p>
            </section>

            <section>
                <h2>10.其他</h2>
                <p>饭米粒理财公示的所有条款、其他规则声明及注册会员在饭米粒理财点击确认签署的电子文件、协议等是本协议的附件，与本协议具有同等法律效力；本协议未约定的，以饭米粒理财公布的条款规则为准，若饭米粒理财公告的规则和条款与本协议不一致的，则以本协议为准。</p>
            </section>
            
        </Container>
    )
};

module.exports = ServiceAgreement_autoPurchase;