require("../../scss/page/serviceAgreement.scss")
import React from "react";
import Container from "../UIComponents/Container";

function ServiceAgreement_yyz_product(){
    return (
        <Container scrollable={true} className="protocol">
                <p> 尊敬的用户：本次计划旨在为农泰金融用户提供更高效、更灵活的服务，以便更好地提高出借人的资金使用效率。请在投资前仔细阅读本协议各条款，以及与本产品相关的全部产品规则。</p>
                <h2>本协议由以下各方签署</h2>
                <p >
                        甲方（投资方）：【        】 <br/>
                        身份证号：     【        】  <br/>
                        农泰金融注册用户名：   【        】<br/>
                        乙方：深圳农泰金融服务有限公司   <br/>
                        住所：深圳市南山区深南大道与铜鼓路交汇大冲商务中心2栋3号楼22层CD单元<br/>
                </p>
                <h2>以上各方在甲方充分了解并清楚知晓本产品相关规则的前提下，双方达成协议如下：  </h2>

                <h3>第1条 月月赚服务计划描述 </h3>
                <p>    月月赚服务计划指甲方加入本计划后即授权乙方，对相关借款项目（ 本协议所指的“借款项目”包括针对该借款项目的债权转让项目）在系统支持下根据农泰金融平台有关规则，依照分散投标标准进行自动投资，并在服务期满后由系统自动协助甲方退出，以满足甲方资金流动性的需求，进而实现灵活投资并获取收益的目的。</p>

                <p>2.1、甲方同意按照如下条件加入乙方提供的本期月月赚服务计划，详情如下：</p>
                <p>   （1）加入本金数额（下称“甲方加入资金”）：（大写）【    】（小写）【    】。 </p>
                <p>   （2）预期年化：以网站公示为准 </p>
                <p>   （3）服务期限：自【         】至【        】止。 </p>
                <p>   （4）收益起算日：【        】 </p>
                <p>2.2、甲方支付完毕甲方加入资金，且本期服务计划达到满标条件时，甲方即加入本期服务计划。甲方可分多笔加入月月赚服务计划，每笔加入资金须以100元及其整数倍进行交易，且累计加入资金不可超过单一客户最大投资规模，单一客户最大投资规模以本网站公示为准。  </p>
                <p>2.3、甲方在签署本协议时不可撤销地委托并授权乙方根据农泰金融平台有关规则并通过网站系统，对借款项目进行自动投标、受让、转让相关债权等操作。甲方不可撤销地委托并授权乙方代为签署相关协议（包括但不限于农泰金融借款协议、债权转让协议等），并收付、冻结、扣划相关款项。 </p>

                <h3>第3条 服务计划的退出 </h3>
                <p>3.1、服务期内，甲方加入资金不可提前退出本计划。服务期限届满之日，甲方将不再享受自动投标服务并自动退出本期服务计划，甲方同意加入本服务即视为甲方不可撤销的授权乙方根据所投标情况在服务期界满时就加入金额以包括但不限于接受借款人还款、代为发起债权转让的方式协助甲方完成资金退出。</p>
                <p>3.2、收益计算和结算：服务期界满之日甲方加入金额不再享有收益；服务期满后，加入资金及收益按本协议相关条款及本网站公示的本期服务计划预期年化进行收益计算，一般在服务期满当日清算至甲方农泰金融账户，具体以农泰金融账户实际显示为准。</p>

                <h3>第4条 费用说明 </h3>
                <p>乙方依据本协议向甲方提供服务，有权向甲方收取相应的服务费用。甲方加入资金投资于各借款项目并按所投标对应的《农泰金融借款协议》及其相关法律文件或协议约定所产生的收益，在扣除月月赚预期收益后的剩余部分，作为本服务计划的服务费（可以合并或分期计提）支付给乙方，归乙方所有。 </p>

                <h3>第5条 本协议的成立及生效</h3>
                <p>本协议以甲方按照农泰金融平台的规则，在农泰金融平台上勾选“我同意《农泰金融月月赚服务协议》”以及点击“购买”按钮（具体以网站显示为准）确认后即时生效。即视为甲方与乙方已达成协议并同意接受月月赚产品及本协议的全部内容，以及农泰金融网站所包含的其他与本协议有关各项规则的所有约定。</p>

                <h3>第6条 月月赚产品项目保障 </h3>
                <p>为降低甲方因投资标的过于集中而带来的信用违约风险，乙方将对甲方加入月月赚产品项目金额根据网站有关规则安排分散化的优先自动投标。 </p>

                <h3>第7条 甲方声明和保证  </h3>
                <p>7.1、在签署本协议书以前，乙方已就本协议书及有关交易文件的全部条款和内容向甲方进行了详细的说明和解释，甲方已认真阅读本协议有关条款，对有关条款不存在任何疑问或异议，并对协议双方的权利、义务、责任与风险有清楚和准确的理解。</p>
                <p>7.2、甲方保证所使用的资金为合法取得，且甲方对该等资金拥有完全且无瑕疵的处分权。 若第三方对加入资金归属、合法性等问题提出异议，由甲方自行解决，并承担因此给乙方及借款项目项下交易相对方造成的损失（如有）。</p>

                <h3>第8条 意外事件 </h3>
                <p>如因司法机关或行政机关对甲方采取强制措施导致其月月赚产品项目金额对应的资金被全部或部分扣划，视为甲方提前退出月月赚产品协议，本协议自动终止。本协议因此而自动终止的，甲方将不再享有相应收益。但甲方仍应按照本协议第4条规定支付相关服务费用。</p>

                <h3>第9条 其他  </h3>
                <p>9.1、本月月赚服务计划和甲方通过点击确认与乙方签署的用户注册协议等相关协议，以及乙方在本网站不时公示之交易规则、说明、公告等涉及甲乙双方权利义务的法律文件，共同构成了约束甲方接受乙方在本协议项下提供之服务时双方行为的协议之整体。</p>
                <p>9.2、本协议采用电子文本形式制成，可以有一份或者多份并且每一份具有同等法律效力，对各方均具有法律约束力。</p>
                <p>9.3、甲方自行承担本服务计划所获收益的应纳税额。 </p>
                <p>9.4、凡因本协议发生的及与本协议有关的任何争议，双方应友好协商解决；协商不成时，可通过诉讼方式解决。所有争议均由乙方所在地人民法院管辖。</p>

                <h3>风险提示：</h3>
                <p>甲方加入月月赚服务计划后，可通过自动投标方式投资借款项目或债权转让项目，但月月赚服务计划不同于银行储蓄，甲方既可能分享投资所产生的收益，也可能承担投资所带来的损失。乙方并不保证本产品一定会产生盈利，亦不保证最低收益。</p>
        </Container>
    )
};

module.exports=ServiceAgreement_yyz_product;