require("../../scss/page/serviceAgreement.scss")
import React from "react";
import Container from "../UIComponents/Container";

function ServiceAgreement_registerToPABank() {
    return (
        <Container scrollable={true} className="protocol">
            <h3 className="text-center"><span >平安银行网络借贷</span><span >资金存管三方协议</span></h3>
            <p ><span >&#xa0;</span></p>
            <h5 ><span >甲方</span><span >：</span>
                <span >为在乙方平台已注册用户</span>
            </h5>
            <p ><span >&#xa0;</span></p>
            <h5 ><span >乙方</span><span >：</span>
                <span >深圳农泰金融服务有限公司</span>
            </h5>
            <p ><span >&#xa0;</span></p>
            <h5><span >丙方：</span><span >平安银行股份有限公司</span></h5>
            <p ><span >&#xa0;</span></p>
            <p style={{textIndent:"2rem"}}><span >在申请办理开通网络借贷资金存管前，请甲方仔细阅读并理解《平安银行网络借贷资金存管三方协议》</span>
                <span >(以下简称“本协议”)</span><span >。请确认甲方已充分知悉并理解本协议之含义，完全同意和接受本协议的全部条款和内容，愿意履行和承担本协议中约定的义务和职责。</span></p>
            <p ><span >甲方保证已明确知晓：丙方不对网络借贷交易行为提供保证或担保，不承担借贷违约责任，不对网络借贷资金本金及收益予以保证或承诺，不承担资金运用风险，不承担借款项目及借贷交易信息真实性的审核责任，不对网络借贷信息数据的真实性、准确性和完整性负责。</span></p>
            <p ><span >&#xa0;</span></p>
            <p ><span >鉴于：</span></p>
            <p style={{textIndent:"2rem"}}><span >甲方是乙方平台核实的实名注册用户；乙方是在中国境内依法设立、专门从事网络借贷信息中介业务活</span>
                <span >动的金融信息中介公司；丙方是在中国境内依法设立</span><span >的商业</span>
                <span >银行，为网络借贷业务提供资金存管服务。甲方的角色包括但不限于出借人、借款人、担保人、渠道方及其他与</span><span >网络</span>
                <span >借贷项目相关的主体等，甲方在乙方平台完成实名注册后，通过乙方</span><span >平台进行网络借贷资金运作。</span>
                <span >乙方和丙方</span><span >或丙方授权机构</span>
                <span >已签订</span><span >编号为20170619的</span>
                <span >《</span><span >平安银行网络借贷资金存管服务协议</span>
                <span >》（以下称“《</span><span >服务</span>
                <span >协议》”）。</span>
            </p>
            <p style={{marginBottom:"2rem"}}><span >为此，甲、乙、丙三方依据《中华人民共和国商业银行法》、《中华人民共和国合同法》、</span>
                <span >《</span><span >网络借贷信息中介机构业务活动管理暂行办法</span>
                <span >》、</span>
                <span >《网络借贷资金存管业务指引》</span><span >、</span>
                <span >乙方交易及结算规则、丙方账户管理及结算规则和其他有关法律、法规、规章以及相关规定，就甲方在乙方进行网络借贷交易</span>
                <span >、</span><span >丙方存管乙方客户网络借贷资金</span>
                <span >及其他相关事宜达成《</span><span >平安银行网络借贷资金存管三方协议</span>
                <span >》，供三方共同遵守。</span>
            </p>
            <h4 ><span >第</span><span >一章</span>
                <span >&#xa0;</span>
                <span >陈述与保证</span>
            </h4>
            <p ><span >1.1  </span><span >甲方陈述与保证</span></p>
            <p ><span >1</span><span >.1</span>
                <span >.1</span><span >甲方具有相应合法的投资或借款等资格，不存在法律、法规、规章、其他规范性文件和乙方交易规则禁止或限制其在乙方进行网络借贷交易的情形。</span></p>
            <p ><span >1.</span><span >1</span>
                <span >.2甲方保证其向乙方、丙方提供的所有证件、资料均合法、真实、准确、完整和有效。甲方资料发生变化时，甲方必须按照协议约定，</span>
                <span >及时</span>
                <span >向</span><span >乙方和丙方</span>
                <span >提交变更后的资料</span>
                <span >。</span>
            </p>
            <p ><span >1.</span><span >1</span>
                <span >.3甲方保证其资金来源合法合规，且允许进行投资性交易。</span>
            </p>
            <p ><span >1.</span><span >1</span>
                <span >.4甲方保证其资金借贷用途合法合规，且按照约定用途使用借贷资金，</span><span >保证不用于出借等其他目的。</span></p>
            <p ><span >1.</span><span >1</span>
                <span >.5甲方明确乙方已向其清楚揭示网络借贷资金的交易风险，乙方向其提供的各种信息及资料仅作为投资参考；甲方已明确知悉、了解并愿意自行承担网络借贷交易风险、网络借贷资金的风险。甲方的交易指令一经发出即不可撤销。</span>
            </p>
            <p ><span >1.</span>
                <span >1</span><span >.6甲方明确乙方已向其清楚提示网络借贷资金的禁止性行为，甲方已明确知悉并同意遵守有关的法律、法规及乙方交易规则。</span></p>
            <p ><span >1.</span>
                <span >1</span><span >.7甲方已明确知悉丙方仅提供网络借贷交易资金的存管服务，即甲方申请办理账户开立、充值、转账、提现等业务须向乙方发出交易指令或业务授权指令，即甲方授权乙方向丙方存管系统发送前述交易指令。</span></p>
            <p ><span >1.</span>
                <span >1</span><span >.8甲方不可撤销地承诺并保证，丙方仅根据存管系统收到的划转指令或业务授权指令办理资金划转及其他相应操作，丙方办理的该等操作均视为已取得甲方合法、有效的授权，对甲方具有法律效力。</span></p>
            <p ><span >1.</span>
                <span >1</span><span >.9甲方已明确知悉并同意：</span></p>
            <p ><span >（1）丙方不参与甲方与乙方或其他用户之间的交易，丙方对甲方在乙方平台的投资收益和本金回收不做任何保证或担保亦不承担任何责任；</span></p>
            <p ><span >（2）丙方对甲方在乙方平台所看到的信息真实性不作任何保证或担保亦不承担任何责任；</span></p>
            <p ><span >（3）丙方对甲方在乙方平台进行的任何操作所产生的投诉或纠纷不承担任何责任。</span></p>
            <p ><span >1.</span>
                <span >1</span><span >.10如乙方出现重大财务风险、诉讼风险等重大风险，导致甲方无法收到预期本金及收益的，甲方保证不得追究丙方任何责任、不得通过任何方式（包括但不限于司法、行政、媒体等途径）向丙方主张任何权利。</span></p>
            <p ><span >1.</span>
                <span >1</span>
                <span >.11甲方已明确知晓在乙方平台注册的甲方</span>
                <span >账</span>
                <span >号和密码</span>
                <span >及收到的短信验证码的重要性。任何使用甲方账号、</span>
                <span >密码</span>
                <span >、短信验证码</span>
                <span >进行的交易委托或资金划转均视为甲方本人所为和有效的甲方指令。</span>
                <span >由于甲方未尽到防范风险的义务造成甲方</span>
                <span >账</span>
                <span >号</span>
                <span >、</span>
                <span >密码</span>
                <span >、短信验证码</span>
                <span >失密及其他非乙方、丙方原因而导致的甲方损失，乙方、丙方不承担任何责任。</span>
            </p>
            <p >
                <span >1.1</span>
                <span >.12甲方保证其具备投资风险意识、风险识别能力、拥有非保本类金融产品投资的经历并熟悉互联网。</span>
            </p>
            <p >
                <span >1.1.13甲方保证不</span>
                <span >从事</span>
                <span >《</span>
                <span >网络借贷信息中介机构业务活动管理暂行办法</span>
                <span >》规定的其不得从事的禁止性行为。</span>
            </p>
            <p >
                <span >1.1</span>
                <span >.14甲方明确已详细阅读本协议所有条款，准确理解其含义，特别是其中有关网络借贷风险、资金存管风险等提示内容和乙方、丙方的责任条款，并同意本协议所有条款。</span>
            </p>
            <p >
                <span >&#xa0;</span>
            </p>
            <p >
                <span >1.2
                                                                                                                                                                                                                                            </span>
                <span >乙方陈述与保证</span>
            </p>
            <p >
                <span >1.</span>
                <span >2</span>
                <span >.1乙方是依法设立的网络借贷信息中介机构，具有相应的资格开展网络借贷相关业务，并已完成相应备案登记和申请获得相应的增值电信业务经营许可等。</span>
            </p>
            <p >
                <span >1.</span>
                <span >2</span>
                <span >.2乙方保证依据法律法规及协议约定为出借人与借款人提供直接信息的采集整理、甄别筛选、网上发布，以及资信评估、借贷撮合、融资咨询、在线争议解决等相关服务。</span>
            </p>
            <p >
                <span >1.</span>
                <span >2</span>
                <span >.3乙方保证聘请会计师事务所定期对甲方资金存管、信息披露情况、信息科技基础设施安全、经营合规性等重点环节实施审计，并保证聘请有资质的信息安全测评机构定期对信息安全实施测评认证，向甲方等披露审计和测评认证结果。</span>
            </p>
            <p >
                <span >1.</span>
                <span >2</span>
                <span >.4乙方保证核实其服务平台实名注册的出借人、借款人的资格条件和借贷项目信息的真实性和合法性，不存在任何虚假借款人和借贷项目，不存在为借款人虚构借贷项目、故意隐瞒借贷项目重大瑕疵等损害出借人合法权益的情形，并保证承担由此而可能引发的经济及法律责任。乙方保证对甲方进行身份识别和资格条件的必要审核，并对甲方资金来源和用途进行合法合规性审核。</span>
            </p>
            <p >
                <span >1.</span>
                <span >2</span>
                <span >.5乙方保证其通过自身平台技术系统向资金存管服务系统所提交的任何交易指令（或业务授权指令）和推送的任何数据的真实性、完整性、准确性、合法性，且均为乙方平台的实名注册用户提交（或授权）的指令或提供（或授权）的数据；如因该类指令或数据信息不准确、不真实、不完整、不合法而导致甲方或丙方等相关方损失的，乙方保证承担全部责任。</span>
            </p>
            <p >
                <span >1.</span>
                <span >2</span>
                <span >.6乙方保证不从事或者接受委托从事有关法律、法规、规章以及相关规定对网络借贷信息中介机构的禁止性规定行为。</span>
            </p>
            <p >
                <span >1.</span>
                <span >2</span>
                <span >.7乙方保证指定丙方作为其唯一一家网络借贷资金存管机构。</span>
            </p>
            <p >
                <span >1.</span>
                <span >2</span>
                <span >.8乙方保证遵守有关的法律、法规及交易和结算规则。</span>
            </p>
            <p >
                <span >1.</span>
                <span >2</span>
                <span >.9乙方保证依据国家法律法规负责承担反洗钱的职责，根据人民银行相关规定做好用户身份识别、信息记录和留存、信息安全检查和审计、信息系统定级备案和等级测试及其他相关工作。</span>
            </p>
            <p >
                <span >1.</span>
                <span >2</span>
                <span >.10乙方明确已详细阅读本协议所有条款，准确理解其含义，特别是其中有关网络借贷禁止性行为条款和丙方的责任条款，并同意本协议所有条款。</span>
            </p>
            <p >
                <span >&#xa0;</span>
            </p>
            <p >
                <span >1.3
                                                                                                                                                                                                                                                                                                                                                                                                                                </span>
                <span >丙方陈述与保证</span>
            </p>
            <p >
                <span >1.</span>
                <span >3</span>
                <span >.1丙方是依法设立的商业银行，能够履行</span>
                <span >网络借贷资金</span>
                <span >存管职责。丙方仅按照本协议条款规定的内容承担资金划转和存管职责。</span>
            </p>
            <p >
                <span >1.</span>
                <span >3</span>
                <span >.2丙方具有</span>
                <span >作为存管人开展网络借贷资金存管业务</span>
                <span >的必要条件，通过资金存管系统能够</span>
                <span >为甲方的网络借贷交易结算资金提供相关的服务。</span>
            </p>
            <p >
                <span >1.</span>
                <span >3.3丙方不负责审核乙方所提供平台用户</span>
                <span >的身份信息、资格条件，不负责审核</span>
                <span >平台用户</span>
                <span >资金来源、用途的合法合规性，不负责审核乙方平台借贷项目信息及借贷交易信息的真实性和合法性，不对网络借贷信息数据的真实性、准确性和完整性</span>
                <span >负责</span>
                <span >。丙方</span>
                <span >不承担借贷违约责任，</span>
                <span >不保证或承诺借款人和借贷项目必然还款，也不保证或承诺甲方能够获得乙方承诺的项目本金和预期收益。丙方不对网络借贷交易以及其他相关行为提供任何保证或其他形式的担保，不承担资金运作风险。</span>
            </p>
            <p >
                <span >1.</span>
                <span >3</span>
                <span >.</span>
                <span >4</span>
                <span >丙方保证严格遵循国家有关法律、法规、规章以及相关规定，办理乙方、甲方的网络借贷资金存管业务。</span>
            </p>
            <p >
                <span >1.</span>
                <span >3</span>
                <span >.</span>
                <span >5</span>
                <span >丙方保证按照本协议约定执行指令，并确保执行行为的及时、准确、有效。</span>
            </p>
            <p >
                <span >&#xa0;</span>
            </p>
            <h4 >
                <span >第二章</span>
                <span >&#xa0;</span>
                <span >释义</span>
            </h4>
            <p >
                <span >2.1</span>
                <span >&#xa0;</span>
                <span >网络借贷资金存管系统：</span>
                <span >
                </span>
                <span >指丙方建立的，用于存管乙方平台上的网络借贷资金，保障安全以及办理交易资金清算、信息披露等业务的信息处理平台</span>
                <span >。系统对接后，丙方将为甲方分别单独开立并管理其</span>
                <span >资金存管子</span>
                <span >账户，对</span>
                <span >其</span>
                <span >交易结算资金进行明细核对和总分核对。</span>
            </p>
            <p >
                <span >2.2
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            </span>
                <span >网络借贷资金：乙方作为委托人，委托丙方作为存管人保管的，由借款人、出借人及相关参与主体通过网络借贷平台进行投融资活动形成的专项借贷资金及相关资金。</span>
            </p>
            <p >
                <span >2.3</span>
                <span >资金存管专户：指乙方在丙方处开立的用于保管甲方交易资金的存管汇总账户。该账户为专用银行对公实体账户，添加托管标识，专户不得开通通兑、</span>
                <span >取现、对外开立支票、透支以及一般企业网银、电话银行、微信银行等功能。乙方保证在开立专户时不就上述功能向丙方的营业机构提出申请。</span>
            </p>
            <p >
                <span >2.4</span>
                <span >资金存管专户子账户/资金存管子账户：指乙方网络借贷平台的出借人、借款人、担保人（如有）等在网络借贷资金存管专用账户下分别开立的子账户。</span>
                <span >资金存管子账户记载甲方网络借贷资金的明细记录，并与甲方在丙方登记的甲方银行结算账户和甲方在乙方平台实名注册的甲方账号建立绑定关系。</span>
            </p>
            <p >
                <span >2.5</span>
                <span >投资人/出借人：指运用合法自有资金通过乙方平台进行相关出借或投资行为的资金提供方。</span>
            </p>
            <p >
                <span >2.</span>
                <span >6</span>
                <span >融资人/借款人：指通过乙方平台发放借款标的实现借款或融资的单位或个人。</span>
            </p>
            <p >
                <span >2.</span>
                <span >7</span>
                <span >平台用户：指在乙方平台注册并完成身份真实性核验的自然人、法人或其他组织等网络借贷业务参与方。甲方属于平台用户。</span>
            </p>
            <p >
                <span >2.</span>
                <span >8</span>
                <span >甲方银行结算账户：是指甲方在商业银行开立的，用于银行资金往来结算的人民币活期账户。</span>
                <span >甲方存管子账户</span>
                <span >只能与甲方在商业银行开立的同名银行结算账户之间建立绑定关系。</span>
            </p>
            <p >
                <span >2.</span>
                <span >9</span>
                <span >绑卡</span>
                <span >：</span>
                <span >是指甲方通过乙方提供的服务渠道将甲方本人名下银行结算账户与其客户交易结算资金管理账户建立绑定关系，绑定后即可通过该银行结算账户办理充值及提现。</span>
            </p>
            <p >
                <span >2.</span>
                <span >10</span>
                <span >解绑卡</span>
                <span >：</span>
                <span >是指甲方通过乙方提供的服务渠道将甲方名下银行结算账户与其</span>
                <span >资金存管子</span>
                <span >账户解除绑定关系，解绑后不能再通过该银行结算账户办理充值及提现。</span>
            </p>
            <p >
                <span >2.</span>
                <span >11</span>
                <span >充值：甲方通过乙方发起，向乙方在丙方开立的资金存管专户转入资金的行为，该行为数据通过资金存管专户子账户记录并保存。</span>
            </p>
            <p >
                <span >2.</span>
                <span >12</span>
                <span >放款：</span>
                <span >是指投资交易成功后资金从</span>
                <span >出借人的资金存管子账户</span>
                <span >转到</span>
                <span >借款</span>
                <span >人</span>
                <span >资金存管子账户</span>
                <span >。</span>
            </p>
            <p >
                <span >2.</span>
                <span >13</span>
                <span >提现：甲方将其在资金存管专户子账户中对应款项的部分或全部划转至其绑定的银行结算账户中的行为。</span>
            </p>
            <p >
                <span >2.</span>
                <span >14</span>
                <span >融资项目/借款项目：借款人通过乙方平台发布的包括融资用途、金额、利率、期限、还款计划、还款方式、担保方式等在内的信息组合。</span>
            </p>
            <p >
                <span >2.</span>
                <span >15</span>
                <span >不可抗力：不能合理控制、不可预见或即使预见亦无法避免的事件。该事件包括但不限于法律法规、存管要求及政策的调整；出台影响业务运行的新颁布法律法规、存管要求、政策规定与政府行为；自然灾害，战争，恐怖袭击或任何其它类似事件</span>
                <span >；</span>
                <span >由于银行、电信运营商系统、线路的故障、调整、升级，或电力中断</span>
                <span >/终断，或黑客攻击、计算机病毒侵入或发作、系统或服务器硬件故障、丙方技术调整或故障、网站升级的问题等原因造成系统无法正常运作或者不能或部分不能提供服务。</span>
            </p>
            <p >
                <span >&#xa0;</span>
            </p>
            <h4 >
                <span >第三章</span>
                <span >&#xa0;</span>
                <span >&#xa0;</span>
                <span >账户开立</span>
            </h4>
            <p >
                <span >3.1</span>
                <span >甲方申请办理网络借贷资金存管业务之前，应当先成为乙方平台实名注册用户，并按照相关法律法规规定提供真实、准确、完整的用户信息及其他相关信息。丙方可随时要求甲方提供的其他相关信息包括但不限于融资信息、未偿还借款信息等。</span>
            </p>
            <p >
                <span >3.2</span>
                <span >丙方根据乙方按照本协议约定提供的甲方资料，在资金存管专户项下为甲方开立资金存管子账户，用以记录甲方的资金台账。乙方确保向丙方提供的甲方资料已取得甲方合法有效的授权，符合存管要求。如甲方为自然人，乙方需在此前按照采集的甲方相关信息通过第三方支付转递至绑定账户开户银行进行实名认证，</span>
                <span >并将绑定账户开户银行返回的</span>
                <span >验证结果</span>
                <span >及时</span>
                <span >传递</span>
                <span >给丙方</span>
                <span >。如</span>
                <span >甲方为法人或其他组织机构，乙方需在此前按照采集的甲方相关信息传递至丙方，丙方通过系统连通核查工商信息并获取核查结果。丙方对前述实名认证的验证结果进行形式审查，不对实名认证的真实性、准确性、有效性</span>
                <span >、合法性</span>
                <span >或相应的后果承担因此的非丙方过错责任。</span>
            </p>
            <p >
                <span >3.3</span>
                <span >乙方应协助甲方向丙方提交开户资料，乙方不得以伪造、篡改等形式向丙方提供虚假的甲方注册信息。</span>
                <span >乙方对网络借贷平台已注册客户信息的真实性、合法性、有效性、准确性承担审核责任，且乙方不得以伪造、篡改等形式向丙方提供虚假的客户注册信息。</span>
            </p>
            <p >
                <span >3.4</span>
                <span >丙方应保证甲方及乙方在丙方开立的账户信息安全。未经乙方许可，丙方不得将乙方提供的验证要素、交易数据、记录擅自向其他与本协议业务无关的其他方透露，且未经甲方</span>
                <span >授权或</span>
                <span >同意，不得将甲方提供的信息用于所提供服务之外的目的，但依据法律法规以及存管规定向存管机构、执法机关、司法机关等机构要求丙方披露上述信息的情况除外。</span>
            </p>
            <p >
                <span >3.5</span>
                <span >丙方有权依据法律法规以及存管规定，按照存管机构、执法机关、司法机关等机构要求，</span>
                <span >对</span>
                <span >资金</span>
                <span >存管</span>
                <span >子</span>
                <span >账户执行账户查询</span>
                <span >、冻结、扣划等指令。</span>
            </p>
            <p >
                <span >3.6</span>
                <span >乙方负责甲方身份认证</span>
                <span >，并确保业务开展过程中需使用或需向第三方披露的甲方信息已得到甲方同意或授权，丙方仅对乙方提供的甲方身份认证信息进行形式审查，</span>
                <span >由乙方单独承担因信息纰漏、瑕疵、错误等原因导致的损害责任</span>
                <span >或其他法律责任</span>
                <span >。丙方于甲方身份验证通过</span>
                <span >后在资金存管系统中建立甲方</span>
                <span >资金存管子账户</span>
                <span >与银行</span>
                <span >结算账户</span>
                <span >的绑定关系。</span>
            </p>
            <p >
                <span >3.7</span>
                <span >除甲方已经在乙方登记的与其</span>
                <span >资金存管子</span>
                <span >账户建立绑定关系的银行结算账户外，</span>
                <span >本协议下的其他任何账户均不具有客户网络借贷资金的提现功能</span>
                <span >。</span>
            </p>
            <p >
                <span >3.8</span>
                <span >甲方可在乙方进行存管资金变化情况的查询</span>
                <span >。若甲方对其客户交易结算资金清算明细或余额有异议，应向乙方查询并核实。若乙方认为有必要，可以要求丙</span>
                <span >方配合进行查询、核实工作。</span>
            </p>
            <p >
                <span >&#xa0;</span>
            </p>
            <h4 >
                <span >第四章</span>
                <span >&#xa0;</span>
                <span >&#xa0;</span>
                <span >资金存取</span>
            </h4>
            <p >
                <span >4.1</span>
                <span >甲方通过乙方渠道进行</span>
                <span >投标、</span>
                <span >缴费、</span>
                <span >提现等</span>
                <span >资金</span>
                <span >交易时，</span>
                <span >必须输入正确的</span>
                <span >由</span>
                <span >丙方资金存管系统向甲方预留手机号发送的</span>
                <span >作为资金及业务授权指令的</span>
                <span >短信验证码</span>
                <span >。</span>
                <span >丙</span>
                <span >方</span>
                <span >通过履行表面一致性的形式审核义务对甲方资金及业务授权指令的真实性</span>
                <span >、有效性</span>
                <span >进行认证。</span>
            </p>
            <p >
                <span >甲方授权乙方进行授权投标、</span>
                <span >授权债权转让、</span>
                <span >授权还款、</span>
                <span >授权缴费、</span>
                <span >授权提现中的某一项或某几项自动业务操作时，代表甲方已充分知晓并同意存管系统有权根据平台发起的自动扣划指令，进行相应款项的划扣、支付、冻结及行使其他权利，该指令将视为甲方的真实意思表示，相关风险由甲方自行承担，甲方</span>
                <span >对此</span>
                <span >予以接受和认可</span>
                <span >。</span>
                <span >如因乙方未能取得甲方的充分授权而可能导致丙方或甲方等相关方损失的，乙方应承担一切相关责任。</span>
            </p>
            <p >
                <span >4.2</span>
                <span >在甲方作为投资人进行投标环节，</span>
                <span >甲方应确保其资金存管子账户中具有充足的可投资金</span>
                <span >，如因甲方交易结算资金管理账户可投资金不足而使得投标不成功的，丙方不承担任何责任。如甲方投标时，乙方需进行审核的，因乙方审核不通过而使得投标不成功的，丙方不承担任何责任。</span>
            </p>
            <p >
                <span >4.3</span>
                <span >在投标资金冻结环节，丙方系统支持在募集期内冻结多个投资人交易结算管理账户资金，待乙方审核通过确认投资交易成功后解冻投资人资金并自动将实际成交资金划转到融资人交易结算资金管理账户。因乙方审核未通过，而导致甲方投资不成功的，丙方不承担任何责任。</span>
            </p>
            <p >
                <span >4.4</span>
                <span >甲方交易结算资金的支取，只能通过乙方网站或手机APP等服务渠道（具体由乙方安排）通过提现的方式转入甲方已经绑定的银行结算账户。</span>
            </p>
            <p >
                <span >4.</span>
                <span >5</span>
                <span >乙方承诺从甲方收取的各项费用已经取得甲方授权，授权文件由乙方保留，如丙方需要查阅时，乙方应予以支持。丙方只根据乙方的指令进行划款，不对扣收款项进行进一步审查，甲乙双方由于扣收费用带来的纠纷，由甲乙双方自行处理，不得追究丙方责任。</span>
            </p>
            <p >
                <span >对于同一</span>
                <span >借款</span>
                <span >项目项下甲方授权乙方办理的除</span>
                <span >乙方</span>
                <span >之外的其他项目参与方之间的</span>
                <span >收费</span>
                <span >行为，乙方承诺已经取得甲方授权，授权文件由乙方保留，如丙方需要查阅时，乙方应予以支持</span>
                <span >。丙方只根据乙方的指令进行划款，不对扣收款项进行进一步审查，</span>
                <span >甲乙双方由于收费行为带来的纠纷</span>
                <span >，由甲乙双方自行处理，不得追究丙方责任。</span>
            </p>
            <p >
                <span >4.6</span>
                <span >乙方承诺不得将自有财产与甲方交易结算资金管理账户内客户资金进行混同，甲方交易结算资金管理账户内客户资金不属于乙方的固有财产。乙方因依法解散、被撤销或被宣告破产等原因进行清算的，交易结算资金管理账户内客户资金不属于清算财产。</span>
            </p>
            <p >
                <span >&#xa0;</span>
            </p>
            <h4 >
                <span >第五章</span>
                <span >&#xa0;</span>
                <span >&#xa0;</span>
                <span >信息变更</span>
            </h4>
            <p >
                <span >5.1</span>
                <span >发生</span>
                <span >有下列情形之一的，乙方或丙方可要求甲方限期纠正，甲方不能按期纠正或拒不纠正的，</span>
                <span >丙方</span>
                <span >可单方面终止本协议：</span>
            </p>
            <p >
                <span >（1）乙方或丙方发现甲方向其提供的资料、证件</span>
                <span >等相关信息</span>
                <span >严重失实；</span>
            </p>
            <p >
                <span >（2）甲方有严重损害乙方或丙方合法权益、影响其正常经营秩序的行为；</span>
            </p>
            <p >
                <span >（3）甲方的资金来源不合法；</span>
            </p>
            <p >
                <span >（4）甲方的资金借贷用途不合法或违反约定用途使用借贷资金；</span>
            </p>
            <p >
                <span >（5）</span>
                <span >甲方</span>
                <span >为非法目的使用资金存管系统；</span>
            </p>
            <p >
                <span >（6）</span>
                <span >甲方</span>
                <span >利用资金存管系统传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或者其他任何非法的信息资料；</span>
            </p>
            <p >
                <span >（7）</span>
                <span >甲方</span>
                <span >利用资金存管系统进行任何不利于丙方</span>
                <span >或者</span>
                <span >对</span>
                <span >丙方造成负面影响</span>
                <span >的行为；</span>
            </p>
            <p >
                <span >（8）</span>
                <span >甲方</span>
                <span >不遵守所有与系统服务有关的协议、规定和程序；</span>
            </p>
            <p >
                <span >（9）存管机构认定的其他情形。</span>
            </p>
            <p >
                <span >对甲方存在第</span>
                <span >1、3、4、5、6、8条所述一种或多种情形的识别责任在于乙方，且乙方一旦发现后，需立即书面告知丙方。</span>
            </p>
            <p >
                <span >5.2</span>
                <span >乙方和丙方单方面终止本协议时，应通过乙方服务渠道向甲方发送协议终止通知，并自协议终止通知发布之时起，乙方与丙方均不接受甲方的资金转账指令。本协议终止，不影响乙方与丙方依法追究甲方违约责任</span>
                <span >或其他法律责任</span>
                <span >的权利。</span>
            </p>
            <p >
                <span >5.3</span>
                <span >乙方如单方变更或注销甲方</span>
                <span >在乙方平台注册的账户</span>
                <span >，应及时通知甲方、丙方。丙方对因此产生的任何纠纷不承担责任。</span>
            </p>
            <p >
                <span >&#xa0;</span>
            </p>
            <h4>
                <span >第六章</span>
                <span >&#xa0;</span>
                <span >&#xa0;</span>
                <span >&#xa0;</span>
                <span >违约事件与责任</span>
            </h4>
            <p >
                <span >6.1</span>
                <span >就乙方未通过丙方</span>
                <span >网络借贷资金存管系统</span>
                <span >为甲方办理的绑卡、充值、提现、解绑卡等业务，丙方无法存管此类充值业务在成功到达甲方在丙方开立的客户交易结算资金管理账户前的资金流向，丙方不承担该类充值业务办理过程中丙</span>
                <span >方系统外发生的现金流的任何存管职责，不对乙方办理该类业务过程中在丙方系统外甲方发生的损失承担存管责任；如因此类业务办理过程中乙方过错给丙方造成损失的，乙方应承担赔偿责任。如乙方因此类业务与甲方、乙方合作方或其他相关方发生纠纷的，由乙方负责解决，丙方不承担任何责任。丙方仅对通过该类充值业务成功到达甲方在丙方开立的客户交易结算资金管理账户中的到账资金承担本协议约定的存管职责及相应责任。</span>
            </p>
            <p >
                <span >6.2</span>
                <span >甲方在签署本协议前已经在乙方办理的任何交易均与丙方无关，丙方仅依据乙方提供的数据办理存量客户迁移工作，由此可能产生的损失</span>
                <span >，丙方不承担责任。</span>
            </p>
            <p >
                <span >6.3</span>
                <span >甲、乙、丙三方各自依照相关法律与本协议承担违约责任，任何一方不对其他方的行为承担责任。</span>
            </p>
            <p >
                <span >6.4</span>
                <span >因法律法规变化、存管部门的存管要求等，导致丙方不能履行存管义务的，丙方有权解除本协议，丙方不承担任何责任。</span>
            </p>
            <p >
                <span >6.5</span>
                <span >
                </span>
                <span >如乙方出现重大财务风险、诉讼风险等重大风险，导致甲方无法收到预期本金及收益的，甲方承诺不得追究丙方责任。</span>
            </p>
            <p >
                <span >6.6</span>
                <span >如发生乙丙双方签署的《</span>
                <span >服务协议</span>
                <span >》项下合同解除的事宜，丙方有权解除与甲方、乙方的存管约定，本协议自动解除。甲乙双方承诺不追究丙方责任。</span>
            </p>
            <p >
                <span >6.7</span>
                <span >除非本协议另有约定,
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                如任一方违反本协议项下所作的任何一项保证或承诺,
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                或未履行本协议项下的任何一项职责或义务,
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                即构成本协议项下的违约。</span>
            </p>
            <p >
                <span >6.8</span>
                <span >任何一方违约，应承担相应的违约责任。如属于可补救差错的，由违约方及时实施相应的补救措施且未造成任何损失的，</span>
                <span >经</span>
                <span >叁</span>
                <span >方协商一致后可不承担违约责任</span>
                <span >。</span>
            </p>
            <p >
                <span >6.9</span>
                <span >一方违约后，</span>
                <span >另两</span>
                <span >方应当采取适当措施防止损失的扩大；没有采取适当措施致使损失扩大的，非违约方不得就扩大的损失要求赔偿。非违约方因防止损失扩大而支出的合理费用，由违约方承担。</span>
            </p>
            <p >
                <span >6.10</span>
                <span >任何一方违约，另</span>
                <span >两</span>
                <span >方有权要求违约方在合理期限内补正或采取补救措施,
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    如违约方在合理期限内或在另</span>
                <span >两</span>
                <span >方书面通知违约方并提出补正要求后30天内仍未补正或未采取补救措施的,
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            另</span>
                <span >两</span>
                <span >方有权决定单方面解除本协议,
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    并书面通知违约方。</span>
            </p>
            <p >
                <span >6.11</span>
                <span >为使</span>
                <span >甲乙丙三</span>
                <span >方实现或履行本协议项下的权利义务均符合法律法规的规定，</span>
                <span >三</span>
                <span >方应各自履行向国家有关机关或部门进行报批（若有）的义务。因未获得国家有关机关或部门的审批同意而导致本协议无法履行的一方，应承担相应责任，并赔偿另</span>
                <span >两</span>
                <span >方的直接经济损失。</span>
            </p>
            <p >
                <span >&#xa0;</span>
            </p>
            <h4 >
                <span >第七章</span>
                <span >&#xa0;</span>
                <span >&#xa0;</span>
                <span >法律适用、争议解决、不可抗力</span>
            </h4>
            <p >
                <span >7</span>
                <span >.1
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                本协议适用中华人民共和国法律，受中华人民共和国法律、法规制约。</span>
            </p>
            <p >
                <span >7</span>
                <span >.2
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            三方在履行本协议过程中发生的争议，应该本着友好、平等、互利的态度协商解决；协商无效，</span>
                <span >任何一方均有权将争议提交华南国际经济贸易仲裁委员会并按其仲裁规则进行仲裁解决。仲裁裁决是终局性的，对</span>
                <span >各</span>
                <span >方均有约束力。在争议解决期间，除争议事项外，</span>
                <span >协议</span>
                <span >三</span>
                <span >方应继续遵守本协议项下的其他条款</span>
                <span >，</span>
                <span >
                    履行本协议项下的其他义务。</span>
            </p>
            <p >
                <span >7</span>
                <span >.3
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        如果任何一方因不可抗力不能履行本协议时，可根据不可抗力的影响部分或全部免除该方的责任。</span>
            </p>
            <p >
                <span >7</span>
                <span >.4
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    因不可抗力造成的迟延、错付及其他损害，或者导致三方不能履行本协议的，遭受不可抗力影响的一方或双方可根据不可抗力的影响，部分或者全部免除责任。声称遭遇不可抗力的一方应立即书面通知另一方，并在其后十五日内应提供有关不可抗力发生和持续的证明文件。声称遭遇不可抗力的一方也应尽其全部合理努力减少不可抗力事件带来的损失。</span>
            </p>
            <h4 >
                <span >第八章</span>
                <span >&#xa0;</span>
                <span >附
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    则</span>
            </h4>
            <p >
                <span >8.1</span>
                <span >乙方按照有关法律法规及乙方交易规则的规定向甲方收取手续费、交易产生税费由交易各方自行缴纳。</span>
            </p>
            <p >
                <span >8.2</span>
                <span >本协议由甲方通过乙方服务渠道在</span>
                <span >乙方</span>
                <span >提供的服务界面操作</span>
                <span >，各方在该服务界面进行的任何形式的确认，包括但不限于数字证书、密码、点击确认等形式均视为各方的可靠电子签名。本协议经（1）甲方通过上述方式确认同意签署本协议，且（2）乙方和丙方提示交易成功后，于系统记录的签约日期之日起发生法律效力。</span>
            </p>
            <p >
                <span >8.3</span>
                <span >本协议生效后，若有关法律法规、规章制度出台或修订，相关条款按新出台或修订的法律法规、规章制度办理；本协议中如有与未来出台或修订的法律法规、规章制度存在冲突或不一致的条款，自相关法律法规、规章制度生效之日起即可确认此类条款自始无效</span>
                <span >，</span>
                <span >但本协议其他条款继续有效。</span>
            </p>
            <p >
                <span >8.4</span>
                <span >本协议根据法律法规规章和存管机构、乙方或丙方业务规章等的规定如需修改或增补，修改或增补的内容将由乙方以公告形式通知甲方，若甲方在</span>
                <span >五个工作日</span>
                <span >内不提出异议，公告内容即成为本协议组成部分。</span>
            </p>
            <p >
                <span >8.5</span>
                <span >本协议所指的通知方式除上述条款中已有约定外，可以是书面送达通知或公告通知。公告通知自公告在乙方丙方经营场所、各方网站发布之日起生效。</span>
            </p>
            <p >
                <span >8.6</span>
                <span >本协议生效后，至下列任一事件发生时终止：</span>
            </p>
            <p >
                <span >（一）乙方或丙方根据本协议的规定终止本协议；</span>
            </p>
            <p >
                <span >（二）乙方、丙方签署的《</span>
                <span >服务协议</span>
                <span >》终止。</span>
            </p>
            <p >
                <span >（以下无正文）</span>
            </p>
            <p >
                <span >&#xa0;</span>
            </p>
        </Container>
    )
};

module.exports = ServiceAgreement_registerToPABank;