const map= {
    "data": [
        {
            "text": "北京市", 
            "id": 110000, 
            "citys": [
                {
                    "text": "北京市", 
                    "id": 110100
                }, 
                {
                    "text": "东城区", 
                    "id": 110101
                }, 
                {
                    "text": "西城区", 
                    "id": 110102
                }, 
                {
                    "text": "朝阳区", 
                    "id": 110105
                }, 
                {
                    "text": "丰台区", 
                    "id": 110106
                }, 
                {
                    "text": "石景山区", 
                    "id": 110107
                }, 
                {
                    "text": "海淀区", 
                    "id": 110108
                }, 
                {
                    "text": "门头沟区", 
                    "id": 110109
                }, 
                {
                    "text": "房山区", 
                    "id": 110111
                }, 
                {
                    "text": "通州区", 
                    "id": 110112
                }, 
                {
                    "text": "顺义区", 
                    "id": 110113
                }, 
                {
                    "text": "昌平区", 
                    "id": 110114
                }, 
                {
                    "text": "大兴区", 
                    "id": 110115
                }, 
                {
                    "text": "怀柔区", 
                    "id": 110116
                }, 
                {
                    "text": "平谷区", 
                    "id": 110117
                }, 
                {
                    "text": "密云县", 
                    "id": 110228
                }, 
                {
                    "text": "延庆县", 
                    "id": 110229
                }
            ]
        }, 
        {
            "text": "天津市", 
            "id": 120000, 
            "citys": [
                {
                    "text": "天津市", 
                    "id": 120100
                }, 
                {
                    "text": "和平区", 
                    "id": 120101
                }, 
                {
                    "text": "河东区", 
                    "id": 120102
                }, 
                {
                    "text": "河西区", 
                    "id": 120103
                }, 
                {
                    "text": "南开区", 
                    "id": 120104
                }, 
                {
                    "text": "河北区", 
                    "id": 120105
                }, 
                {
                    "text": "红桥区", 
                    "id": 120106
                }, 
                {
                    "text": "东丽区", 
                    "id": 120110
                }, 
                {
                    "text": "西青区", 
                    "id": 120111
                }, 
                {
                    "text": "津南区", 
                    "id": 120112
                }, 
                {
                    "text": "北辰区", 
                    "id": 120113
                }, 
                {
                    "text": "武清区", 
                    "id": 120114
                }, 
                {
                    "text": "宝坻区", 
                    "id": 120115
                }, 
                {
                    "text": "滨海新区", 
                    "id": 120116
                }, 
                {
                    "text": "宁河县", 
                    "id": 120221
                }, 
                {
                    "text": "静海县", 
                    "id": 120223
                }, 
                {
                    "text": "蓟县", 
                    "id": 120225
                }
            ]
        }, 
        {
            "text": "河北省", 
            "id": 130000, 
            "citys": [
                {
                    "text": "石家庄市", 
                    "id": 130100
                }, 
                {
                    "text": "唐山市", 
                    "id": 130200
                }, 
                {
                    "text": "秦皇岛市", 
                    "id": 130300
                }, 
                {
                    "text": "邯郸市", 
                    "id": 130400
                }, 
                {
                    "text": "邢台市", 
                    "id": 130500
                }, 
                {
                    "text": "保定市", 
                    "id": 130600
                }, 
                {
                    "text": "张家口市", 
                    "id": 130700
                }, 
                {
                    "text": "承德市", 
                    "id": 130800
                }, 
                {
                    "text": "沧州市", 
                    "id": 130900
                }, 
                {
                    "text": "廊坊市", 
                    "id": 131000
                }, 
                {
                    "text": "衡水市", 
                    "id": 131100
                }
            ]
        }, 
        {
            "text": "山西省", 
            "id": 140000, 
            "citys": [
                {
                    "text": "太原市", 
                    "id": 140100
                }, 
                {
                    "text": "大同市", 
                    "id": 140200
                }, 
                {
                    "text": "阳泉市", 
                    "id": 140300
                }, 
                {
                    "text": "长治市", 
                    "id": 140400
                }, 
                {
                    "text": "晋城市", 
                    "id": 140500
                }, 
                {
                    "text": "朔州市", 
                    "id": 140600
                }, 
                {
                    "text": "晋中市", 
                    "id": 140700
                }, 
                {
                    "text": "运城市", 
                    "id": 140800
                }, 
                {
                    "text": "忻州市", 
                    "id": 140900
                }, 
                {
                    "text": "临汾市", 
                    "id": 141000
                }, 
                {
                    "text": "吕梁市", 
                    "id": 141100
                }
            ]
        }, 
        {
            "text": "内蒙古自治区", 
            "id": 150000, 
            "citys": [
                {
                    "text": "呼和浩特市", 
                    "id": 150100
                }, 
                {
                    "text": "包头市", 
                    "id": 150200
                }, 
                {
                    "text": "乌海市", 
                    "id": 150300
                }, 
                {
                    "text": "赤峰市", 
                    "id": 150400
                }, 
                {
                    "text": "通辽市", 
                    "id": 150500
                }, 
                {
                    "text": "鄂尔多斯市", 
                    "id": 150600
                }, 
                {
                    "text": "呼伦贝尔市", 
                    "id": 150700
                }, 
                {
                    "text": "巴彦淖尔市", 
                    "id": 150800
                }, 
                {
                    "text": "乌兰察布市", 
                    "id": 150900
                }, 
                {
                    "text": "兴安盟", 
                    "id": 152200
                }, 
                {
                    "text": "锡林郭勒盟", 
                    "id": 152500
                }, 
                {
                    "text": "阿拉善盟", 
                    "id": 152900
                }
            ]
        }, 
        {
            "text": "辽宁省", 
            "id": 210000, 
            "citys": [
                {
                    "text": "沈阳市", 
                    "id": 210100
                }, 
                {
                    "text": "大连市", 
                    "id": 210200
                }, 
                {
                    "text": "鞍山市", 
                    "id": 210300
                }, 
                {
                    "text": "抚顺市", 
                    "id": 210400
                }, 
                {
                    "text": "本溪市", 
                    "id": 210500
                }, 
                {
                    "text": "丹东市", 
                    "id": 210600
                }, 
                {
                    "text": "锦州市", 
                    "id": 210700
                }, 
                {
                    "text": "营口市", 
                    "id": 210800
                }, 
                {
                    "text": "阜新市", 
                    "id": 210900
                }, 
                {
                    "text": "辽阳市", 
                    "id": 211000
                }, 
                {
                    "text": "盘锦市", 
                    "id": 211100
                }, 
                {
                    "text": "铁岭市", 
                    "id": 211200
                }, 
                {
                    "text": "朝阳市", 
                    "id": 211300
                }, 
                {
                    "text": "葫芦岛市", 
                    "id": 211400
                }, 
                {
                    "text": "金普新区", 
                    "id": 211500
                }
            ]
        }, 
        {
            "text": "吉林省", 
            "id": 220000, 
            "citys": [
                {
                    "text": "长春市", 
                    "id": 220100
                }, 
                {
                    "text": "吉林市", 
                    "id": 220200
                }, 
                {
                    "text": "四平市", 
                    "id": 220300
                }, 
                {
                    "text": "辽源市", 
                    "id": 220400
                }, 
                {
                    "text": "通化市", 
                    "id": 220500
                }, 
                {
                    "text": "白山市", 
                    "id": 220600
                }, 
                {
                    "text": "松原市", 
                    "id": 220700
                }, 
                {
                    "text": "白城市", 
                    "id": 220800
                }, 
                {
                    "text": "延边朝鲜族自治州", 
                    "id": 222400
                }
            ]
        }, 
        {
            "text": "黑龙江省", 
            "id": 230000, 
            "citys": [
                {
                    "text": "哈尔滨市", 
                    "id": 230100
                }, 
                {
                    "text": "齐齐哈尔市", 
                    "id": 230200
                }, 
                {
                    "text": "鸡西市", 
                    "id": 230300
                }, 
                {
                    "text": "鹤岗市", 
                    "id": 230400
                }, 
                {
                    "text": "双鸭山市", 
                    "id": 230500
                }, 
                {
                    "text": "大庆市", 
                    "id": 230600
                }, 
                {
                    "text": "伊春市", 
                    "id": 230700
                }, 
                {
                    "text": "佳木斯市", 
                    "id": 230800
                }, 
                {
                    "text": "七台河市", 
                    "id": 230900
                }, 
                {
                    "text": "牡丹江市", 
                    "id": 231000
                }, 
                {
                    "text": "黑河市", 
                    "id": 231100
                }, 
                {
                    "text": "绥化市", 
                    "id": 231200
                }, 
                {
                    "text": "大兴安岭地区", 
                    "id": 232700
                }
            ]
        }, 
        {
            "text": "上海市", 
            "id": 310000, 
            "citys": [
                {
                    "text": "上海市", 
                    "id": 310100
                }, 
                {
                    "text": "黄浦区", 
                    "id": 310101
                }, 
                {
                    "text": "卢湾区", 
                    "id": 310103
                }, 
                {
                    "text": "徐汇区", 
                    "id": 310104
                }, 
                {
                    "text": "长宁区", 
                    "id": 310105
                }, 
                {
                    "text": "静安区", 
                    "id": 310106
                }, 
                {
                    "text": "普陀区", 
                    "id": 310107
                }, 
                {
                    "text": "闸北区", 
                    "id": 310108
                }, 
                {
                    "text": "虹口区", 
                    "id": 310109
                }, 
                {
                    "text": "杨浦区", 
                    "id": 310110
                }, 
                {
                    "text": "闵行区", 
                    "id": 310112
                }, 
                {
                    "text": "宝山区", 
                    "id": 310113
                }, 
                {
                    "text": "嘉定区", 
                    "id": 310114
                }, 
                {
                    "text": "浦东新区", 
                    "id": 310115
                }, 
                {
                    "text": "金山区", 
                    "id": 310116
                }, 
                {
                    "text": "松江区", 
                    "id": 310117
                }, 
                {
                    "text": "青浦区", 
                    "id": 310118
                }, 
                {
                    "text": "奉贤区", 
                    "id": 310120
                }, 
                {
                    "text": "崇明县", 
                    "id": 310230
                }
            ]
        }, 
        {
            "text": "江苏省", 
            "id": 320000, 
            "citys": [
                {
                    "text": "南京市", 
                    "id": 320100
                }, 
                {
                    "text": "无锡市", 
                    "id": 320200
                }, 
                {
                    "text": "徐州市", 
                    "id": 320300
                }, 
                {
                    "text": "常州市", 
                    "id": 320400
                }, 
                {
                    "text": "苏州市", 
                    "id": 320500
                }, 
                {
                    "text": "南通市", 
                    "id": 320600
                }, 
                {
                    "text": "连云港市", 
                    "id": 320700
                }, 
                {
                    "text": "淮安市", 
                    "id": 320800
                }, 
                {
                    "text": "盐城市", 
                    "id": 320900
                }, 
                {
                    "text": "扬州市", 
                    "id": 321000
                }, 
                {
                    "text": "镇江市", 
                    "id": 321100
                }, 
                {
                    "text": "泰州市", 
                    "id": 321200
                }, 
                {
                    "text": "宿迁市", 
                    "id": 321300
                }
            ]
        }, 
        {
            "text": "浙江省", 
            "id": 330000, 
            "citys": [
                {
                    "text": "杭州市", 
                    "id": 330100
                }, 
                {
                    "text": "宁波市", 
                    "id": 330200
                }, 
                {
                    "text": "温州市", 
                    "id": 330300
                }, 
                {
                    "text": "嘉兴市", 
                    "id": 330400
                }, 
                {
                    "text": "湖州市", 
                    "id": 330500
                }, 
                {
                    "text": "绍兴市", 
                    "id": 330600
                }, 
                {
                    "text": "金华市", 
                    "id": 330700
                }, 
                {
                    "text": "衢州市", 
                    "id": 330800
                }, 
                {
                    "text": "舟山市", 
                    "id": 330900
                }, 
                {
                    "text": "台州市", 
                    "id": 331000
                }, 
                {
                    "text": "丽水市", 
                    "id": 331100
                }, 
                {
                    "text": "舟山群岛新区", 
                    "id": 331200
                }
            ]
        }, 
        {
            "text": "安徽省", 
            "id": 340000, 
            "citys": [
                {
                    "text": "合肥市", 
                    "id": 340100
                }, 
                {
                    "text": "芜湖市", 
                    "id": 340200
                }, 
                {
                    "text": "蚌埠市", 
                    "id": 340300
                }, 
                {
                    "text": "淮南市", 
                    "id": 340400
                }, 
                {
                    "text": "马鞍山市", 
                    "id": 340500
                }, 
                {
                    "text": "淮北市", 
                    "id": 340600
                }, 
                {
                    "text": "铜陵市", 
                    "id": 340700
                }, 
                {
                    "text": "安庆市", 
                    "id": 340800
                }, 
                {
                    "text": "黄山市", 
                    "id": 341000
                }, 
                {
                    "text": "滁州市", 
                    "id": 341100
                }, 
                {
                    "text": "阜阳市", 
                    "id": 341200
                }, 
                {
                    "text": "宿州市", 
                    "id": 341300
                }, 
                {
                    "text": "巢湖市", 
                    "id": 341400
                }, 
                {
                    "text": "六安市", 
                    "id": 341500
                }, 
                {
                    "text": "亳州市", 
                    "id": 341600
                }, 
                {
                    "text": "池州市", 
                    "id": 341700
                }, 
                {
                    "text": "宣城市", 
                    "id": 341800
                }
            ]
        }, 
        {
            "text": "福建省", 
            "id": 350000, 
            "citys": [
                {
                    "text": "福州市", 
                    "id": 350100
                }, 
                {
                    "text": "厦门市", 
                    "id": 350200
                }, 
                {
                    "text": "莆田市", 
                    "id": 350300
                }, 
                {
                    "text": "三明市", 
                    "id": 350400
                }, 
                {
                    "text": "泉州市", 
                    "id": 350500
                }, 
                {
                    "text": "漳州市", 
                    "id": 350600
                }, 
                {
                    "text": "南平市", 
                    "id": 350700
                }, 
                {
                    "text": "龙岩市", 
                    "id": 350800
                }, 
                {
                    "text": "宁德市", 
                    "id": 350900
                }
            ]
        }, 
        {
            "text": "江西省", 
            "id": 360000, 
            "citys": [
                {
                    "text": "南昌市", 
                    "id": 360100
                }, 
                {
                    "text": "景德镇市", 
                    "id": 360200
                }, 
                {
                    "text": "萍乡市", 
                    "id": 360300
                }, 
                {
                    "text": "九江市", 
                    "id": 360400
                }, 
                {
                    "text": "新余市", 
                    "id": 360500
                }, 
                {
                    "text": "鹰潭市", 
                    "id": 360600
                }, 
                {
                    "text": "赣州市", 
                    "id": 360700
                }, 
                {
                    "text": "吉安市", 
                    "id": 360800
                }, 
                {
                    "text": "宜春市", 
                    "id": 360900
                }, 
                {
                    "text": "抚州市", 
                    "id": 361000
                }, 
                {
                    "text": "上饶市", 
                    "id": 361100
                }
            ]
        }, 
        {
            "text": "山东省", 
            "id": 370000, 
            "citys": [
                {
                    "text": "济南市", 
                    "id": 370100
                }, 
                {
                    "text": "青岛市", 
                    "id": 370200
                }, 
                {
                    "text": "淄博市", 
                    "id": 370300
                }, 
                {
                    "text": "枣庄市", 
                    "id": 370400
                }, 
                {
                    "text": "东营市", 
                    "id": 370500
                }, 
                {
                    "text": "烟台市", 
                    "id": 370600
                }, 
                {
                    "text": "潍坊市", 
                    "id": 370700
                }, 
                {
                    "text": "济宁市", 
                    "id": 370800
                }, 
                {
                    "text": "泰安市", 
                    "id": 370900
                }, 
                {
                    "text": "威海市", 
                    "id": 371000
                }, 
                {
                    "text": "日照市", 
                    "id": 371100
                }, 
                {
                    "text": "莱芜市", 
                    "id": 371200
                }, 
                {
                    "text": "临沂市", 
                    "id": 371300
                }, 
                {
                    "text": "德州市", 
                    "id": 371400
                }, 
                {
                    "text": "聊城市", 
                    "id": 371500
                }, 
                {
                    "text": "滨州市", 
                    "id": 371600
                }, 
                {
                    "text": "菏泽市", 
                    "id": 371700
                }
            ]
        }, 
        {
            "text": "河南省", 
            "id": 410000, 
            "citys": [
                {
                    "text": "郑州市", 
                    "id": 410100
                }, 
                {
                    "text": "开封市", 
                    "id": 410200
                }, 
                {
                    "text": "洛阳市", 
                    "id": 410300
                }, 
                {
                    "text": "平顶山市", 
                    "id": 410400
                }, 
                {
                    "text": "安阳市", 
                    "id": 410500
                }, 
                {
                    "text": "鹤壁市", 
                    "id": 410600
                }, 
                {
                    "text": "新乡市", 
                    "id": 410700
                }, 
                {
                    "text": "焦作市", 
                    "id": 410800
                }, 
                {
                    "text": "濮阳市", 
                    "id": 410900
                }, 
                {
                    "text": "许昌市", 
                    "id": 411000
                }, 
                {
                    "text": "漯河市", 
                    "id": 411100
                }, 
                {
                    "text": "三门峡市", 
                    "id": 411200
                }, 
                {
                    "text": "南阳市", 
                    "id": 411300
                }, 
                {
                    "text": "商丘市", 
                    "id": 411400
                }, 
                {
                    "text": "信阳市", 
                    "id": 411500
                }, 
                {
                    "text": "周口市", 
                    "id": 411600
                }, 
                {
                    "text": "驻马店市", 
                    "id": 411700
                }, 
                {
                    "text": "省直辖县级行政区划", 
                    "id": 419000
                }
            ]
        }, 
        {
            "text": "湖北省", 
            "id": 420000, 
            "citys": [
                {
                    "text": "武汉市", 
                    "id": 420100
                }, 
                {
                    "text": "黄石市", 
                    "id": 420200
                }, 
                {
                    "text": "十堰市", 
                    "id": 420300
                }, 
                {
                    "text": "宜昌市", 
                    "id": 420500
                }, 
                {
                    "text": "襄樊市", 
                    "id": 420600
                }, 
                {
                    "text": "鄂州市", 
                    "id": 420700
                }, 
                {
                    "text": "荆门市", 
                    "id": 420800
                }, 
                {
                    "text": "孝感市", 
                    "id": 420900
                }, 
                {
                    "text": "荆州市", 
                    "id": 421000
                }, 
                {
                    "text": "黄冈市", 
                    "id": 421100
                }, 
                {
                    "text": "咸宁市", 
                    "id": 421200
                }, 
                {
                    "text": "随州市", 
                    "id": 421300
                }, 
                {
                    "text": "恩施土家族苗族自治州", 
                    "id": 422800
                }, 
                {
                    "text": "省直辖县级行政区划", 
                    "id": 429000
                }
            ]
        }, 
        {
            "text": "湖南省", 
            "id": 430000, 
            "citys": [
                {
                    "text": "长沙市", 
                    "id": 430100
                }, 
                {
                    "text": "株洲市", 
                    "id": 430200
                }, 
                {
                    "text": "湘潭市", 
                    "id": 430300
                }, 
                {
                    "text": "衡阳市", 
                    "id": 430400
                }, 
                {
                    "text": "邵阳市", 
                    "id": 430500
                }, 
                {
                    "text": "岳阳市", 
                    "id": 430600
                }, 
                {
                    "text": "常德市", 
                    "id": 430700
                }, 
                {
                    "text": "张家界市", 
                    "id": 430800
                }, 
                {
                    "text": "益阳市", 
                    "id": 430900
                }, 
                {
                    "text": "郴州市", 
                    "id": 431000
                }, 
                {
                    "text": "永州市", 
                    "id": 431100
                }, 
                {
                    "text": "怀化市", 
                    "id": 431200
                }, 
                {
                    "text": "娄底市", 
                    "id": 431300
                }, 
                {
                    "text": "湘西土家族苗族自治州", 
                    "id": 433100
                }
            ]
        }, 
        {
            "text": "广东省", 
            "id": 440000, 
            "citys": [
                {
                    "text": "广州市", 
                    "id": 440100
                }, 
                {
                    "text": "韶关市", 
                    "id": 440200
                }, 
                {
                    "text": "深圳市", 
                    "id": 440300
                }, 
                {
                    "text": "珠海市", 
                    "id": 440400
                }, 
                {
                    "text": "汕头市", 
                    "id": 440500
                }, 
                {
                    "text": "佛山市", 
                    "id": 440600
                }, 
                {
                    "text": "江门市", 
                    "id": 440700
                }, 
                {
                    "text": "湛江市", 
                    "id": 440800
                }, 
                {
                    "text": "茂名市", 
                    "id": 440900
                }, 
                {
                    "text": "肇庆市", 
                    "id": 441200
                }, 
                {
                    "text": "惠州市", 
                    "id": 441300
                }, 
                {
                    "text": "梅州市", 
                    "id": 441400
                }, 
                {
                    "text": "汕尾市", 
                    "id": 441500
                }, 
                {
                    "text": "河源市", 
                    "id": 441600
                }, 
                {
                    "text": "阳江市", 
                    "id": 441700
                }, 
                {
                    "text": "清远市", 
                    "id": 441800
                }, 
                {
                    "text": "东莞市", 
                    "id": 441900
                }, 
                {
                    "text": "中山市", 
                    "id": 442000
                }, 
                {
                    "text": "潮州市", 
                    "id": 445100
                }, 
                {
                    "text": "揭阳市", 
                    "id": 445200
                }, 
                {
                    "text": "云浮市", 
                    "id": 445300
                }
            ]
        }, 
        {
            "text": "广西壮族自治区", 
            "id": 450000, 
            "citys": [
                {
                    "text": "南宁市", 
                    "id": 450100
                }, 
                {
                    "text": "柳州市", 
                    "id": 450200
                }, 
                {
                    "text": "桂林市", 
                    "id": 450300
                }, 
                {
                    "text": "梧州市", 
                    "id": 450400
                }, 
                {
                    "text": "北海市", 
                    "id": 450500
                }, 
                {
                    "text": "防城港市", 
                    "id": 450600
                }, 
                {
                    "text": "钦州市", 
                    "id": 450700
                }, 
                {
                    "text": "贵港市", 
                    "id": 450800
                }, 
                {
                    "text": "玉林市", 
                    "id": 450900
                }, 
                {
                    "text": "百色市", 
                    "id": 451000
                }, 
                {
                    "text": "贺州市", 
                    "id": 451100
                }, 
                {
                    "text": "河池市", 
                    "id": 451200
                }, 
                {
                    "text": "来宾市", 
                    "id": 451300
                }, 
                {
                    "text": "崇左市", 
                    "id": 451400
                }
            ]
        }, 
        {
            "text": "海南省", 
            "id": 460000, 
            "citys": [
                {
                    "text": "海口市", 
                    "id": 460100
                }, 
                {
                    "text": "三亚市", 
                    "id": 460200
                }, 
                {
                    "text": "三沙市", 
                    "id": 460300
                }, 
                {
                    "text": "省直辖县级行政区划", 
                    "id": 469000
                }
            ]
        }, 
        {
            "text": "重庆市", 
            "id": 500000, 
            "citys": [
                {
                    "text": "重庆市", 
                    "id": 500100
                }, 
                {
                    "text": "万州区", 
                    "id": 500101
                }, 
                {
                    "text": "涪陵区", 
                    "id": 500102
                }, 
                {
                    "text": "渝中区", 
                    "id": 500103
                }, 
                {
                    "text": "大渡口区", 
                    "id": 500104
                }, 
                {
                    "text": "江北区", 
                    "id": 500105
                }, 
                {
                    "text": "沙坪坝区", 
                    "id": 500106
                }, 
                {
                    "text": "九龙坡区", 
                    "id": 500107
                }, 
                {
                    "text": "南岸区", 
                    "id": 500108
                }, 
                {
                    "text": "北碚区", 
                    "id": 500109
                }, 
                {
                    "text": "万盛区", 
                    "id": 500110
                }, 
                {
                    "text": "双桥区", 
                    "id": 500111
                }, 
                {
                    "text": "渝北区", 
                    "id": 500112
                }, 
                {
                    "text": "巴南区", 
                    "id": 500113
                }, 
                {
                    "text": "黔江区", 
                    "id": 500114
                }, 
                {
                    "text": "长寿区", 
                    "id": 500115
                }, 
                {
                    "text": "江津区", 
                    "id": 500116
                }, 
                {
                    "text": "合川区", 
                    "id": 500117
                }, 
                {
                    "text": "永川区", 
                    "id": 500118
                }, 
                {
                    "text": "南川区", 
                    "id": 500119
                }, 
                {
                    "text": "綦江县", 
                    "id": 500222
                }, 
                {
                    "text": "潼南县", 
                    "id": 500223
                }, 
                {
                    "text": "铜梁县", 
                    "id": 500224
                }, 
                {
                    "text": "大足县", 
                    "id": 500225
                }, 
                {
                    "text": "荣昌县", 
                    "id": 500226
                }, 
                {
                    "text": "璧山县", 
                    "id": 500227
                }, 
                {
                    "text": "梁平县", 
                    "id": 500228
                }, 
                {
                    "text": "城口县", 
                    "id": 500229
                }, 
                {
                    "text": "丰都县", 
                    "id": 500230
                }, 
                {
                    "text": "垫江县", 
                    "id": 500231
                }, 
                {
                    "text": "武隆县", 
                    "id": 500232
                }, 
                {
                    "text": "忠县", 
                    "id": 500233
                }, 
                {
                    "text": "开县", 
                    "id": 500234
                }, 
                {
                    "text": "云阳县", 
                    "id": 500235
                }, 
                {
                    "text": "奉节县", 
                    "id": 500236
                }, 
                {
                    "text": "巫山县", 
                    "id": 500237
                }, 
                {
                    "text": "巫溪县", 
                    "id": 500238
                }, 
                {
                    "text": "石柱土家族自治县", 
                    "id": 500240
                }, 
                {
                    "text": "秀山土家族苗族自治县", 
                    "id": 500241
                }, 
                {
                    "text": "酉阳土家族苗族自治县", 
                    "id": 500242
                }, 
                {
                    "text": "彭水苗族土家族自治县", 
                    "id": 500243
                }, 
                {
                    "text": "两江新区", 
                    "id": 500300
                }
            ]
        }, 
        {
            "text": "四川省", 
            "id": 510000, 
            "citys": [
                {
                    "text": "成都市", 
                    "id": 510100
                }, 
                {
                    "text": "自贡市", 
                    "id": 510300
                }, 
                {
                    "text": "攀枝花市", 
                    "id": 510400
                }, 
                {
                    "text": "泸州市", 
                    "id": 510500
                }, 
                {
                    "text": "德阳市", 
                    "id": 510600
                }, 
                {
                    "text": "绵阳市", 
                    "id": 510700
                }, 
                {
                    "text": "广元市", 
                    "id": 510800
                }, 
                {
                    "text": "遂宁市", 
                    "id": 510900
                }, 
                {
                    "text": "内江市", 
                    "id": 511000
                }, 
                {
                    "text": "乐山市", 
                    "id": 511100
                }, 
                {
                    "text": "南充市", 
                    "id": 511300
                }, 
                {
                    "text": "眉山市", 
                    "id": 511400
                }, 
                {
                    "text": "宜宾市", 
                    "id": 511500
                }, 
                {
                    "text": "广安市", 
                    "id": 511600
                }, 
                {
                    "text": "达州市", 
                    "id": 511700
                }, 
                {
                    "text": "雅安市", 
                    "id": 511800
                }, 
                {
                    "text": "巴中市", 
                    "id": 511900
                }, 
                {
                    "text": "资阳市", 
                    "id": 512000
                }, 
                {
                    "text": "阿坝藏族羌族自治州", 
                    "id": 513200
                }, 
                {
                    "text": "甘孜藏族自治州", 
                    "id": 513300
                }, 
                {
                    "text": "凉山彝族自治州", 
                    "id": 513400
                }
            ]
        }, 
        {
            "text": "贵州省", 
            "id": 520000, 
            "citys": [
                {
                    "text": "贵阳市", 
                    "id": 520100
                }, 
                {
                    "text": "六盘水市", 
                    "id": 520200
                }, 
                {
                    "text": "遵义市", 
                    "id": 520300
                }, 
                {
                    "text": "安顺市", 
                    "id": 520400
                }, 
                {
                    "text": "毕节市", 
                    "id": 520500
                }, 
                {
                    "text": "铜仁市", 
                    "id": 520600
                }, 
                {
                    "text": "铜仁地区", 
                    "id": 522200
                }, 
                {
                    "text": "黔西南布依族苗族自治州", 
                    "id": 522300
                }, 
                {
                    "text": "毕节地区", 
                    "id": 522400
                }, 
                {
                    "text": "黔东南苗族侗族自治州", 
                    "id": 522600
                }, 
                {
                    "text": "黔南布依族苗族自治州", 
                    "id": 522700
                }
            ]
        }, 
        {
            "text": "云南省", 
            "id": 530000, 
            "citys": [
                {
                    "text": "昆明市", 
                    "id": 530100
                }, 
                {
                    "text": "曲靖市", 
                    "id": 530300
                }, 
                {
                    "text": "玉溪市", 
                    "id": 530400
                }, 
                {
                    "text": "保山市", 
                    "id": 530500
                }, 
                {
                    "text": "昭通市", 
                    "id": 530600
                }, 
                {
                    "text": "丽江市", 
                    "id": 530700
                }, 
                {
                    "text": "普洱市", 
                    "id": 530800
                }, 
                {
                    "text": "临沧市", 
                    "id": 530900
                }, 
                {
                    "text": "楚雄彝族自治州", 
                    "id": 532300
                }, 
                {
                    "text": "红河哈尼族彝族自治州", 
                    "id": 532500
                }, 
                {
                    "text": "文山壮族苗族自治州", 
                    "id": 532600
                }, 
                {
                    "text": "西双版纳傣族自治州", 
                    "id": 532800
                }, 
                {
                    "text": "大理白族自治州", 
                    "id": 532900
                }, 
                {
                    "text": "德宏傣族景颇族自治州", 
                    "id": 533100
                }, 
                {
                    "text": "怒江傈僳族自治州", 
                    "id": 533300
                }, 
                {
                    "text": "迪庆藏族自治州", 
                    "id": 533400
                }
            ]
        }, 
        {
            "text": "西藏自治区", 
            "id": 540000, 
            "citys": [
                {
                    "text": "拉萨市", 
                    "id": 540100
                }, 
                {
                    "text": "日喀则市", 
                    "id": 540200
                }, 
                {
                    "text": "昌都市", 
                    "id": 540300
                }, 
                {
                    "text": "昌都地区", 
                    "id": 542100
                }, 
                {
                    "text": "山南地区", 
                    "id": 542200
                }, 
                {
                    "text": "日喀则地区", 
                    "id": 542300
                }, 
                {
                    "text": "那曲地区", 
                    "id": 542400
                }, 
                {
                    "text": "阿里地区", 
                    "id": 542500
                }, 
                {
                    "text": "林芝地区", 
                    "id": 542600
                }
            ]
        }, 
        {
            "text": "陕西省", 
            "id": 610000, 
            "citys": [
                {
                    "text": "西安市", 
                    "id": 610100
                }, 
                {
                    "text": "铜川市", 
                    "id": 610200
                }, 
                {
                    "text": "宝鸡市", 
                    "id": 610300
                }, 
                {
                    "text": "咸阳市", 
                    "id": 610400
                }, 
                {
                    "text": "渭南市", 
                    "id": 610500
                }, 
                {
                    "text": "延安市", 
                    "id": 610600
                }, 
                {
                    "text": "汉中市", 
                    "id": 610700
                }, 
                {
                    "text": "榆林市", 
                    "id": 610800
                }, 
                {
                    "text": "安康市", 
                    "id": 610900
                }, 
                {
                    "text": "商洛市", 
                    "id": 611000
                }, 
                {
                    "text": "西咸新区", 
                    "id": 611100
                }
            ]
        }, 
        {
            "text": "甘肃省", 
            "id": 620000, 
            "citys": [
                {
                    "text": "兰州市", 
                    "id": 620100
                }, 
                {
                    "text": "嘉峪关市", 
                    "id": 620200
                }, 
                {
                    "text": "金昌市", 
                    "id": 620300
                }, 
                {
                    "text": "白银市", 
                    "id": 620400
                }, 
                {
                    "text": "天水市", 
                    "id": 620500
                }, 
                {
                    "text": "武威市", 
                    "id": 620600
                }, 
                {
                    "text": "张掖市", 
                    "id": 620700
                }, 
                {
                    "text": "平凉市", 
                    "id": 620800
                }, 
                {
                    "text": "酒泉市", 
                    "id": 620900
                }, 
                {
                    "text": "庆阳市", 
                    "id": 621000
                }, 
                {
                    "text": "定西市", 
                    "id": 621100
                }, 
                {
                    "text": "陇南市", 
                    "id": 621200
                }, 
                {
                    "text": "临夏回族自治州", 
                    "id": 622900
                }, 
                {
                    "text": "甘南藏族自治州", 
                    "id": 623000
                }
            ]
        }, 
        {
            "text": "青海省", 
            "id": 630000, 
            "citys": [
                {
                    "text": "西宁市", 
                    "id": 630100
                }, 
                {
                    "text": "海东市", 
                    "id": 630200
                }, 
                {
                    "text": "海东地区", 
                    "id": 632100
                }, 
                {
                    "text": "海北藏族自治州", 
                    "id": 632200
                }, 
                {
                    "text": "黄南藏族自治州", 
                    "id": 632300
                }, 
                {
                    "text": "海南藏族自治州", 
                    "id": 632500
                }, 
                {
                    "text": "果洛藏族自治州", 
                    "id": 632600
                }, 
                {
                    "text": "玉树藏族自治州", 
                    "id": 632700
                }, 
                {
                    "text": "海西蒙古族藏族自治州", 
                    "id": 632800
                }
            ]
        }, 
        {
            "text": "宁夏回族自治区", 
            "id": 640000, 
            "citys": [
                {
                    "text": "银川市", 
                    "id": 640100
                }, 
                {
                    "text": "石嘴山市", 
                    "id": 640200
                }, 
                {
                    "text": "吴忠市", 
                    "id": 640300
                }, 
                {
                    "text": "固原市", 
                    "id": 640400
                }, 
                {
                    "text": "中卫市", 
                    "id": 640500
                }
            ]
        }, 
        {
            "text": "新疆维吾尔自治区", 
            "id": 650000, 
            "citys": [
                {
                    "text": "乌鲁木齐市", 
                    "id": 650100
                }, 
                {
                    "text": "克拉玛依市", 
                    "id": 650200
                }, 
                {
                    "text": "吐鲁番地区", 
                    "id": 652100
                }, 
                {
                    "text": "哈密地区", 
                    "id": 652200
                }, 
                {
                    "text": "昌吉回族自治州", 
                    "id": 652300
                }, 
                {
                    "text": "博尔塔拉蒙古自治州", 
                    "id": 652700
                }, 
                {
                    "text": "巴音郭楞蒙古自治州", 
                    "id": 652800
                }, 
                {
                    "text": "阿克苏地区", 
                    "id": 652900
                }, 
                {
                    "text": "克孜勒苏柯尔克孜自治州", 
                    "id": 653000
                }, 
                {
                    "text": "喀什地区", 
                    "id": 653100
                }, 
                {
                    "text": "和田地区", 
                    "id": 653200
                }, 
                {
                    "text": "伊犁哈萨克自治州", 
                    "id": 654000
                }, 
                {
                    "text": "塔城地区", 
                    "id": 654200
                }, 
                {
                    "text": "阿勒泰地区", 
                    "id": 654300
                }, 
                {
                    "text": "自治区直辖县级行政区划", 
                    "id": 659000
                }
            ]
        }, 
        {
            "text": "台湾", 
            "id": 710000, 
            "citys": [
                {
                    "text": "台北市", 
                    "id": 710100
                }, 
                {
                    "text": "基隆市", 
                    "id": 710200
                }, 
                {
                    "text": "台东县", 
                    "id": 710210
                }, 
                {
                    "text": "台北县", 
                    "id": 710220
                }, 
                {
                    "text": "台北市", 
                    "id": 710222
                }, 
                {
                    "text": "宜兰县", 
                    "id": 710260
                }, 
                {
                    "text": "新竹县", 
                    "id": 710300
                }, 
                {
                    "text": "桃园县", 
                    "id": 710330
                }, 
                {
                    "text": "苗栗县", 
                    "id": 710360
                }, 
                {
                    "text": "台中市", 
                    "id": 710400
                }, 
                {
                    "text": "台中县", 
                    "id": 710420
                }, 
                {
                    "text": "彰化县", 
                    "id": 710500
                }, 
                {
                    "text": "南投县", 
                    "id": 710540
                }, 
                {
                    "text": "嘉义县", 
                    "id": 710600
                }, 
                {
                    "text": "云林县", 
                    "id": 710640
                }, 
                {
                    "text": "台南市", 
                    "id": 710700
                }, 
                {
                    "text": "台南县", 
                    "id": 710730
                }, 
                {
                    "text": "高雄县", 
                    "id": 710800
                }, 
                {
                    "text": "澎湖县", 
                    "id": 710880
                }, 
                {
                    "text": "屏东县", 
                    "id": 710900
                }, 
                {
                    "text": "花莲县", 
                    "id": 710950
                }, 
                {
                    "text": "宜兰县", 
                    "id": 712200
                }, 
                {
                    "text": "桃园县", 
                    "id": 712300
                }, 
                {
                    "text": "新竹县", 
                    "id": 712400
                }, 
                {
                    "text": "苗栗县", 
                    "id": 712500
                }, 
                {
                    "text": "彰化县", 
                    "id": 712700
                }, 
                {
                    "text": "南投县", 
                    "id": 712800
                }, 
                {
                    "text": "云林县", 
                    "id": 712900
                }, 
                {
                    "text": "嘉义县", 
                    "id": 713000
                }, 
                {
                    "text": "屏东县", 
                    "id": 713300
                }, 
                {
                    "text": "台东县", 
                    "id": 713400
                }, 
                {
                    "text": "花莲县", 
                    "id": 713500
                }, 
                {
                    "text": "澎湖县", 
                    "id": 713600
                }, 
                {
                    "text": "金门县", 
                    "id": 713700
                }, 
                {
                    "text": "连江县", 
                    "id": 713800
                }
            ]
        }, 
        {
            "text": "香港特别行政区", 
            "id": 810000, 
            "citys": [
                {
                    "text": "香港岛", 
                    "id": 810100
                }, 
                {
                    "text": "九龙", 
                    "id": 810200
                }, 
                {
                    "text": "新界", 
                    "id": 810300
                }
            ]
        }, 
        {
            "text": "澳门特别行政区", 
            "id": 820000, 
            "citys": [
                {
                    "text": "澳门半岛", 
                    "id": 820100
                }, 
                {
                    "text": "氹仔岛", 
                    "id": 820200
                }, 
                {
                    "text": "路环岛", 
                    "id": 820300
                }
            ]
        }
    ],
    getProvinceList(){
        let provinceList=[];
        this.data.forEach(function(province) {
            provinceList.push(province.text);
        }, this);

        return provinceList;
    },
    getCityListBy(provinceText){
        let cityArr=[];
        let cityList=[];
        //ES5的forEach无法中止或者跳出循环，所以用普通简单的for循环来代替
        for(let i=0;i<this.data.length;i++){
            if(this.data[i].text === provinceText){
                cityArr= this.data[i].citys;
                break;
            }
        }

        cityArr.forEach(function(city) {
            cityList.push(city.text);
        }, this);

        return cityList;
    },
    getProvinceIdByText(provinceText){
        for(let i=0;i<this.data.length;i++){
            if(this.data[i].text === provinceText){
                return this.data[i].id;
            }
        }
    },
    getCityInfoListByProvinceText(provinceText){
        for(let i=0;i<this.data.length;i++){
            if(this.data[i].text === provinceText){
                return this.data[i].citys;
            }
        }
    },
    getCityIdByText(provinceText,cityText){
        let cityInfoList=this.getCityInfoListByProvinceText(provinceText);
        for(let i=0;i<cityInfoList.length;i++){
            if(cityInfoList[i].text === cityText){
                return cityInfoList[i].id;
            }
        }
    }
}

export default  map;